README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-09 Thu 17:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Extending a Language &#x2014; Writing Powerful Macros in Scheme</title>
<meta name="author" content="Marc Nieper-Wißkirchen" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Extending a Language &#x2014; Writing Powerful Macros in Scheme</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6611a2d">1. Preface</a></li>
<li><a href="#orgf9c747e">2. Prerequisites</a>
<ul>
<li><a href="#orge43e3d9">2.1. Chez Scheme</a></li>
<li><a href="#orgaa36917">2.2. Emacs</a></li>
<li><a href="#org36d98c1">2.3. Org</a></li>
<li><a href="#org42af0d7">2.4. Geiser</a></li>
<li><a href="#org04788ff">2.5. Paredit</a></li>
<li><a href="#orgc33891f">2.6. Initialization</a></li>
</ul>
</li>
<li><a href="#org377870a">3. The Scheme programming language</a></li>
<li><a href="#orgb72210a">4. Some simple macros</a>
<ul>
<li><a href="#org62bbcd5">4.1. Incrementing a variable</a></li>
<li><a href="#org88bae46">4.2. A tracing <code>let</code></a></li>
<li><a href="#org45638a5">4.3. Accessing vector locations through variables</a></li>
</ul>
</li>
<li><a href="#org7f65354">5. Syntax objects</a>
<ul>
<li><a href="#org411e766">5.1. Identifiers</a></li>
<li><a href="#orgabd305d">5.2. Constructing syntax objects</a></li>
<li><a href="#orgcf186bb">5.3. Destructing syntax objects</a></li>
</ul>
</li>
<li><a href="#org4e4fe76">6. Syntax-case macros</a>
<ul>
<li><a href="#orgf1e8c38">6.1. Macro transformers</a></li>
<li><a href="#org9ad4f08">6.2. A fluid <code>let</code></a></li>
<li><a href="#org2a2cc89">6.3. Implementing a variant type in Scheme</a></li>
</ul>
</li>
<li><a href="#orgf67db64">7. Breaking hygiene</a>
<ul>
<li><a href="#org020a5a3">7.1. A classical loop macro</a></li>
<li><a href="#org727c9de">7.2. Convenience syntax to bind implicit identifiers</a></li>
<li><a href="#org2c645c6">7.3. Definitions that make the bound name accessible</a></li>
<li><a href="#org2425df9">7.4. Definitions of constants</a></li>
<li><a href="#org000b7fa">7.5. A pitfall</a></li>
</ul>
</li>
<li><a href="#org85581d7">8. Phasing</a>
<ul>
<li><a href="#org4f580b4">8.1. (Relative) phases</a></li>
<li><a href="#orgb7a52eb">8.2. Identifier references at different phases</a></li>
</ul>
</li>
<li><a href="#org9d48857">9. Extensions</a>
<ul>
<li><a href="#org0fd5875">9.1. Aliases</a></li>
<li><a href="#orgcfe517e">9.2. Syntax parameters</a></li>
<li><a href="#orgbf1d363">9.3. Identifier properties</a></li>
</ul>
</li>
<li><a href="#org28a9422">10. Complex examples</a>
<ul>
<li><a href="#orgfe7512d">10.1. An LR(1) parser generator implemented as a Scheme macro</a></li>
</ul>
</li>
<li><a href="#orgd9c6470">11. Exercises</a></li>
</ul>
</div>
</div>
<p>
The canonical HTML-formatted version of this document can be found at
<a href="https://mnieper.github.io/scheme-macros/README.html">https://mnieper.github.io/scheme-macros/README.html</a>.  The interactive
Org document is hosted at <a href="https://github.com/mnieper/scheme-macros">https://github.com/mnieper/scheme-macros</a>.
</p>

<div id="outline-container-org6611a2d" class="outline-2">
<h2 id="org6611a2d"><span class="section-number-2">1.</span> Preface</h2>
<div class="outline-text-2" id="text-1">
<p>
This document is an introduction to writing powerful macros in Scheme.
It was initially written on the occasion of a tutorial I give at the
<a href="https://bobkonf.de/2023/en/">BOB2023 Konferenz</a> in Berlin on 17 March 2023.
</p>

<p>
The macro facility, especially its built-in <i>hygiene</i>, is one of the
fundamental pillars of the Scheme programming language.  While more
complicated than the simple token-replacing macros of other languages
like C, Scheme macros can be written in a way that make them robust
and so that the abstractions they offer seamless blend into the
language and cannot be distinguished from syntactic forms built into
the language.  It is often felt that this expressiveness makes writing
Scheme macros more complicated (even something of a black art) than
writing C or Common Lisp macros, for example.  One goal of this
tutorial is to convince the audience otherwise.
</p>

<p>
While the Scheme macro facility has always been avant-garde (and this
is one of the reasons why Scheme was chosen as the implementation
language for this tutorial), a lot of what is said here also applies
to languages that provide corresponding features.  It is also a appeal
to language designers that languages should include a macro facility
as Scheme does, as this allows for small language cores and enables
the user to provide their own syntactic abstractions.
</p>

<p>
Another reason why the Scheme language is used in this tutorial is
that it has an exceptionally clear semantics, is a compact language,
and is easy to learn.
</p>

<p>
The document can both be read as is or used interactively in an Emacs
session.  In the following section, a possible setup is described.
</p>
</div>
</div>

<div id="outline-container-orgf9c747e" class="outline-2">
<h2 id="orgf9c747e"><span class="section-number-2">2.</span> Prerequisites</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge43e3d9" class="outline-3">
<h3 id="orge43e3d9"><span class="section-number-3">2.1.</span> Chez Scheme</h3>
<div class="outline-text-3" id="text-2-1">
<p>
We need a Scheme implementation.  This tutorial assumes <a href="https://cisco.github.io/ChezScheme/">Chez Scheme</a>,
which is one of the most mature, standard-compliant Scheme
implementations.  You can get Chez Scheme from its homepage.  On
Debian-based GNU/Linux system like Ubuntu, it is prepackaged.
</p>
</div>
</div>

<div id="outline-container-orgaa36917" class="outline-3">
<h3 id="orgaa36917"><span class="section-number-3">2.2.</span> Emacs</h3>
<div class="outline-text-3" id="text-2-2">
<p>
We will use <a href="https://www.gnu.org/software/emacs/">GNU Emacs</a> as our development environment, which has great
tooling for Scheme.  The typical GNU/Linux system ships with it.
</p>

<p>
For GNU Emacs &lt; 28, enable the <a href="https://elpa.nongnu.org/">NonGNU Emacs Lisp Package Archive</a> in
your <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Init-File.html">init file</a> or <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Easy-Customization.html">customize</a> the variable <code>package-archives</code>.
Likewise, enable the <a href="https://elpa.nongnu.org/nongnu-devel/">NonGNU-devel ELPA Packages</a>.
</p>
</div>
</div>

<div id="outline-container-org36d98c1" class="outline-3">
<h3 id="org36d98c1"><span class="section-number-3">2.3.</span> Org</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<a href="https://orgmode.org/">Org Mode</a> is a GNU Emacs major mode that allows to document, edit and
execute source code.
</p>

<p>
The current versions of Org packaged with Emacs hide Scheme evaluation
errors.  This is fixed in the version in Org's git repository, for
which Org <a href="https://orgmode.org/org.html#Installation">provides installation instructions</a>.
</p>

<p>
Familiarize yourself with how one works with <a href="https://orgmode.org/org.html#Working-with-Source-Code">source code in an Org
document</a>, especially how to <a href="https://orgmode.org/org.html#Editing-Source-Code">edit</a> and <a href="https://orgmode.org/org.html#Evaluating-Code-Blocks">execute code</a>.
</p>
</div>
</div>

<div id="outline-container-org42af0d7" class="outline-3">
<h3 id="org42af0d7"><span class="section-number-3">2.4.</span> Geiser</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<a href="https://www.nongnu.org/geiser/">Geiser</a> is a GNU Emacs package that allows to runs Scheme processes in
GNU Emacs, and which is used by Org's Babel.  To install it, it is
enough to install the package <a href="https://gitlab.com/emacs-geiser/chez/-/blob/master/geiser-chez.el">geiser-chez</a> using GNU Emacs' <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Package-Menu.html">package
menu</a>.  We need the most recent development version.
</p>
</div>
</div>

<div id="outline-container-org04788ff" class="outline-3">
<h3 id="org04788ff"><span class="section-number-3">2.5.</span> Paredit</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<a href="https://paredit.org/">Paredit</a>, a tool for parenthetical editing in Emacs makes working with
Scheme code a lot more pleasant.  Like Geiser, it can be installed
through GNU Emacs' package manager.
</p>
</div>
</div>
