README.html

<div id="outline-container-orgc33891f" class="outline-3">
<h3 id="orgc33891f"><span class="section-number-3">2.6.</span> Initialization</h3>
<div class="outline-text-3" id="text-2-6">
<p>
After the GNU Emacs packages have been installed, we want to customize
them for our needs.  The following should go into your init file
unless you want to execute the following code every time you start GNU
Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">compile</span>)
(autoload 'enable-paredit-mode <span style="color: #8b2252;">"paredit"</span> <span style="color: #8b2252;">"Turn on pseudo-structural editing of Lisp code"</span> t)
(add-hook 'scheme-mode-hook #'enable-paredit-mode)
(show-paren-mode t)
(<span style="color: #a020f0;">setq</span> auto-mode-alist (cons '(<span style="color: #8b2252;">"\\.ss"</span> . scheme-mode) auto-mode-alist))
(<span style="color: #a020f0;">setq</span> auto-mode-alist (cons '(<span style="color: #8b2252;">"\\.sls"</span> . scheme-mode) auto-mode-alist))
(<span style="color: #a020f0;">setq</span> auto-mode-alist (cons '(<span style="color: #8b2252;">"\\.sps"</span> . scheme-mode) auto-mode-alist))
(add-to-list 'compilation-error-regexp-alist
             '(<span style="color: #8b2252;">"^</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">(</span><span style="color: #8b2252;">Exception</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">|</span><span style="color: #8b2252;">Warning</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">)</span><span style="color: #8b2252;">.*: .* </span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">(</span><span style="color: #8b2252;">line </span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">(</span><span style="color: #8b2252;">[0-9]+</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">)</span><span style="color: #8b2252;">, char </span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">(</span><span style="color: #8b2252;">[0-9]+</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">)</span><span style="color: #8b2252;"> of </span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">(</span><span style="color: #8b2252;">.*</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">)</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">)</span><span style="color: #8b2252;">"</span> 5 3 4 nil 2))
(<span style="color: #a020f0;">setq</span> geiser-default-implementation 'chez)
(org-babel-do-load-languages
 'org-babel-load-languages
 '((scheme . t)))
(<span style="color: #a020f0;">setq</span> org-confirm-babel-evaluate nil)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org377870a" class="outline-2">
<h2 id="org377870a"><span class="section-number-2">3.</span> The Scheme programming language</h2>
<div class="outline-text-2" id="text-3">
<p>
Scheme is programming language of the Lisp family.  Its defining
properties are its uniform parenthesized syntax (inherited from Lisp),
first-class procedures and continuations, lexical scoping, dynamic
typing, proper tail calls and hygienic macros.  It is primarly a
functional programming language but allows many other programming
paradigms.
</p>

<p>
The Scheme programming language was developed in the 1970s by Guy
L. Steele and Gerald Jay Sussman.  Since then it has been refined and
further developed through a series of de facto standards called the
Revised<sup><i>n</i></sup> Report(s) on the Algorithmic Language Scheme (R/n/RS).
The two current standards are R6RS (2007) and R7RS-small (2013).
Despite the versioning and the timeline, R6RS is the more detailed,
more advanced and more modern standard<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.
</p>

<p>
In this tutorial, we work with the macro facility of R6RS, which is
far more powerful than the one of R7RS-small, and also discuss some
proposed or implemented extensions.  Such extensions to the Scheme
programming language are often proposed, discussed and implemented
using the <a href="https://srfi.schemers.org/">Scheme Requests for Implementation</a> process, where everyone
can submit a <i>SRFI</i> extending the Scheme programming language.
Whenever we speak of the <i>Scheme</i> language in this text, we default to
the R6RS dialect.
</p>

<p>
For practical programming, one needs, of course, an implementation.
Scheme is possibly the programming language with the highest number of
implementations.  The R6RS language has some very high-quality
implementations, including <a href="https://cisco.github.io/ChezScheme/">Chez Scheme</a>, <a href="https://www.gnu.org/software/guile/">GNU Guile</a>, <a href="https://scheme.fail/">Loko Scheme</a>, and <a href="https://racket-lang.org/">Racket</a>,
so for any application area, there will be a suitable Scheme system.
</p>
</div>
</div>

<div id="outline-container-orgb72210a" class="outline-2">
<h2 id="orgb72210a"><span class="section-number-2">4.</span> Some simple macros</h2>
<div class="outline-text-2" id="text-4">
<p>
Let us call a <i>combination</i> an expression in Scheme of the form
</p>

<div class="org-src-container">
<pre class="src src-scheme">(operator operand ...)
</pre>
</div>

<p>
An example is given by the following expression evaluating to the answer of life:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(* 21 2)
</pre>
</div>

<pre class="example" id="org3c65143">
42
</pre>

<p>
Such a combination is usually evaluated by evaluating the operator and
the operands in some unspecific order and by then calling the
procedure resulting from the operator evaluation with arguments
resulting from the operand evaluations.
</p>

<p>
Scheme, however, also possesses special forms, which do not follow
this evaluation strategy.  An example is given by the conditional <code>if</code>.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">if</span> (number? 2)
    'ok
    (/ 1 0))
</pre>
</div>

<pre class="example" id="orgee29f95">
ok
</pre>

<p>
If the conditional were a normal combination, the operands, and <code>(/ 1
0)</code> in particular, would have been evaluated first (and
unconditionally).  Scheme recognizes special forms through the
operator in first position, namely if it is a keyword (a special type
of identifier).  The Scheme macro facility allows the programmer to
define their own keywords.
</p>
</div>
