README.html

<div id="outline-container-org62bbcd5" class="outline-3">
<h3 id="org62bbcd5"><span class="section-number-3">4.1.</span> Incrementing a variable</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Let us ignore for a moment that mutation is frowned upon in functional
programming and let us assume that we have to frequently increase the
value of variables in our program.  Given a variable <code>x</code>, this is done
in Scheme through the following expression:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">set!</span> x (+ x 1))
</pre>
</div>
<p>
That the variable <code>x</code> is repeated in this expression is unpleasant
(and may be considered a violation of the DRY principle), so we want
an operator akin to C's pre/post-increment operator.  Unfortunately,
Scheme does not provide such an operator, but, fortunately, it doesn't
have to because we can build one ourself.
</p>

<p>
Our first attempt could be to write a procedure (the primary means of
abstraction in functional programming languages)<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">incr!</span>
  (<span style="color: #a020f0;">lambda</span> (x)
    (<span style="color: #a020f0;">set!</span> x (+ x 1))))
</pre>
</div>

<p>
This attempt, however, is failed:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> 1)
(incr! x)
x
</pre>
</div>

<pre class="example" id="org5225610">
1
</pre>

<p>
The reason that it doesn't work &#x2014; the variable's value is still 1
and not 2 &#x2014; is that <code>(incr! x)</code> is a normal combination as
introduced earlier.  As the arguments are evaluated first and the
procedure is called with their values, in this example, <code>incr!</code> is
called with the argument <code>1</code>.  This is then bound to a new variable
<code>x</code> locally to <code>incr!</code>.  It is this variable, which is increased by 1
and not the top-level variable.
</p>

<p>
The solution is, of course, to define <code>incr!</code> not as a procedure<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>
but as a keyword.  In the Scheme programming language, the
<code>define-syntax</code> keyword can be used for it:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">incr!</span>
  (<span style="color: #a020f0;">syntax-rules</span> ()
    ((incr! x)
     (<span style="color: #a020f0;">set!</span> x (+ x 1)))))
</pre>
</div>

<p>
This definition says that <code>incr!</code> is defined to be a new keyword,
implemented as a macro.  The <code>syntax-rules</code> line shall be viewed as
boilerplate for the moment (and we will come back to it later).
Important are the next two lines.  The form <code>(incr! x)</code> is a pattern
saying that the macro matches against a use of the form <code>(keyword
form)</code> (where <code>keyword</code> is necessarily <code>incr!</code>).  When the macro is
used, the pattern variable <code>x</code> is bound to the <code>form</code>.  The form
<code>(set! x (+ x 1))</code> is a template.  When the macro is used, the pattern
variables in the template are replaced with the forms they are bound
to and the substituted template is then used in place of the macro.
</p>

<p>
In the following example, <code>(incr! y)</code> is effectively substituted by
<code>(set! y (+ y 1))</code>, so we have achieved what we wanted<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">y</span> 10)
(incr! y)
y
</pre>
</div>

<pre class="example" id="org4bfcc58">
11
</pre>

<p>
As a side note, we see from the discussion that <code>set!</code> is another
keyword (like <code>if</code>, it cannot be a procedure for the same reasons why
our attempt to write <code>incr!</code> as a procedure doesn't work).
</p>

<p>
As any other identifier in Scheme, the identifier <code>set!</code> can also be
rebound as in the following example:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([<span style="color: #a020f0;">set!</span> (<span style="color: #a020f0;">lambda</span> (x y) (+ x y))])
  (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> 1)
  (<span style="color: #a020f0;">set!</span> x 2))
</pre>
</div>

<pre class="example" id="orgae3d2f7">
3
</pre>

<p>
In the body of the <code>let</code> form, <code>set!</code> has lost its usual meaning and
is bound to a procedure adding its two arguments.  It is most
interesting to see what happens when we use our <code>incr!</code> macro, which
refers to <code>set!</code>, in the body of the <code>let</code> form:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([<span style="color: #a020f0;">set!</span> (<span style="color: #a020f0;">lambda</span> (x y) (/ 1 0))])
  (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> 1)
  (incr! x)
  x)
</pre>
</div>

<pre class="example" id="orgf53d13f">
2
</pre>

<p>
This example yields the correct result <code>2</code>, although calling <code>set!</code>
within the <code>let</code> body would raise an exception.  The reason for this
is the already mentioned hygiene of Scheme macros.  The identifier
<code>set!</code> in the output of the <code>incr!</code> macro didn't occur in its input
but came from the macro definition.  Scheme macro hygiene now ensures
that it still refers to the lexical binding it had where it occured in
the program source.  Note that the C preprocessor &#x2014; as an example
for a very simple, if not primitive macro facility &#x2014; wouldn't have
ensured it.  Whether a C macro works correctly or not often depends on
the lexical environment of the macro use site.
</p>

<p>
We say that hygienic Scheme macros are referentially transparent.
This is already known from procedures in functional programming
languages and lexical scoping:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">f</span>
  (<span style="color: #a020f0;">let</span> ([x 1])
    (<span style="color: #a020f0;">lambda</span> () x)))

(list (f)
      (<span style="color: #a020f0;">let</span> ([x 2])
        (f)))
</pre>
</div>

<pre class="example" id="org256fe30">
(1 1)
</pre>

<p>
Wherever the procedure <code>f</code> is called, it always evaluates to <code>1</code>.
</p>

<p>
We finish this subsection with another example of hygiene:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([<span style="color: #a020f0;">set!</span> 2])
  (incr! set!)
  set!)
</pre>
</div>

<pre class="example" id="org10430ed">
3
</pre>

<p>
The result, which is the increment of the original value of the
variable <code>set!</code> by one, can again be explained by hygiene and by
distinguishing the identifier <code>set!</code> that appears in the macro use and
the same-named identifier <code>set!</code> appearing in the macro source.
Without distinguishing both, the macro use <code>(incr! set!)</code> is
transcribed to <code>(set! set! (+ set! 1))</code>.  In this transcription, the
first <code>set!</code> originates from the macro transformer and thus still
refers to the lexical binding it had at that place.  The other two
occurrences of <code>set!</code> are copies from the macro input and thus refer
to the lexical binding of <code>set!</code> as a let-bound variable.
</p>
</div>
</div>
