README.html

<div id="outline-container-org88bae46" class="outline-3">
<h3 id="org88bae46"><span class="section-number-3">4.2.</span> A tracing <code>let</code></h3>
<div class="outline-text-3" id="text-4-2">
<p>
Simple loops are often written using the named <code>let</code> form as in the following example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">fact</span>
  (<span style="color: #a020f0;">lambda</span> (n)
    (<span style="color: #a020f0;">let</span> <span style="color: #0000ff;">f</span> ([n n] [a 1])
      (<span style="color: #a020f0;">if</span> (zero? n)
          a
          (f (- n 1) (* a n))))))
</pre>
</div>

<p>
In order to facilitate debugging, let us define a version of the named
<code>let</code> form that prints the arguments with which the loop recursion is
entered and with which it is exited<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>.  As <code>let</code> is a special
form, this has to be a special form as well, so let us write our second macro:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #b22222;">;; </span><span style="color: #b22222;">A form of a named let that prints information about each recursive</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">call.</span>
(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">trace-let</span>
  (<span style="color: #a020f0;">syntax-rules</span> ()
    [(<span style="color: #a020f0;">trace-let</span> name ([var expr] ...) body1 ... body2)
     (<span style="color: #a020f0;">let</span> <span style="color: #0000ff;">f</span> ([depth 0] [var expr] ...)
       (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">name</span>
         (<span style="color: #a020f0;">lambda</span> (var ...)
           (f (+ depth 1) var ...)))
       (indent depth)
       (display <span style="color: #8b2252;">"("</span>)
       (display 'name)
       (<span style="color: #a020f0;">begin</span>
         (display <span style="color: #8b2252;">" "</span>)
         (display var))
       ...
       (display <span style="color: #8b2252;">")"</span>)
       (newline)
       (call-with-values
           (<span style="color: #a020f0;">lambda</span> ()
             body1 ... body2)
         (<span style="color: #a020f0;">lambda</span> val*
           (indent depth)
           (fold-left
            (<span style="color: #a020f0;">lambda</span> (sep val)
              (display sep)
              (display val)
              <span style="color: #8b2252;">" "</span>)
            <span style="color: #8b2252;">""</span> val*)
           (newline)
           (apply values val*))))]))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Helper procedure referenced by the macro output of the macro above.</span>
(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">indent</span>
  (<span style="color: #a020f0;">let</span> ([pattern <span style="color: #8b2252;">"| "</span>])
    (<span style="color: #a020f0;">lambda</span> (depth)
      (<span style="color: #a020f0;">do</span> ([i 0 (+ i 1)])
          ((&gt; i depth))
        (display (string-ref pattern (mod i 2)))))))
</pre>
</div>

<p>
In this macro, the pattern is given by <code>(trace-let name ([var expr]
...) body1 ... body2)</code>, while the template makes up the bulk of the
macro.  Already in the pattern, we see a new syntax, the ellipsis
<code>...</code>.  It means that the subpattern preceding it may appear repeated
zero or more times in the input.  When such a subpattern is matched,
the contained pattern variables represent lists of forms.
</p>

<p>
In the template, the ellipsis means to repeat the preceding
subtemplate as many times as the pattern variables contained in it
represent forms.  For this to work, every such subtemplate has to
contain at least one pattern variable, obviously, and all pattern
variables contained in it have to represent lists of forms of the same
length.
</p>

<p>
Note the occurrence of <code>begin</code> in the macro.  Normally, in a procedure
body, <code>(begin expression ...)</code> is equivalent to the list of
<code>expressions</code>, here, however, we have to use it.  The reason is that
following ellipsis refers the immediately preceding subtemplate, so it
is crucial that the two display commands (which we both want to
repeated once per variable) appear in a single form.
</p>

<p>
When we run the following test, we see the given result printed.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">fact</span>
  (<span style="color: #a020f0;">lambda</span> (n)
    (<span style="color: #a020f0;">trace-let</span> f ([n n])
      (<span style="color: #a020f0;">if</span> (zero? n)
          1
          (* (f (- n 1)) n)))))
(fact 3)
</pre>
</div>

<pre class="example" id="orgc6dec6d">
|(f 3)
| (f 2)
| |(f 1)
| | (f 0)
| | 1
| |1
| 2
|6
</pre>

<p>
We can demonstrate another facet of hygiene with this particular
macro.  In the macro template, which is part of the macro's source,
the identifier <code>f</code> is introduced and is bound by <code>let</code> appearing next
to in the source.  In the particular use of the macro above, the
pattern variable <code>name</code> represents another identifier name <code>f</code>, namely
the identifier with that name that appears in the macro use.  Although
<code>f</code> coming from the macro use is bound in the macro output within the
scope of the binding of <code>f</code> coming from the macro text, it does not
shadow the other <code>f</code> as this would be a violation of hygiene.
Instead, the identifier <code>f</code> coming from the macro text is renamed by
the Scheme macro expander, at least conceptually (as it isn't inserted
as a free identifier, the precise name obviously doesn't matter).
</p>

<p>
The ellipsis can also be used to turn our <code>incr!</code> macro into one that
accepts more than one variable to increment:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">incr!</span>
  (<span style="color: #a020f0;">syntax-rules</span> ()
    ((incr! x ...)
     (<span style="color: #a020f0;">begin</span>
       (<span style="color: #a020f0;">set!</span> x (+ x 1))
       ...))))
</pre>
</div>

<p>
Let us briefly test our new extended macro:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> 10)
(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">y</span> 20)
(incr! x y)
(list x y)
</pre>
</div>

<pre class="example" id="orgddfd641">
(11 21)
</pre>

<p>
The role of <code>begin</code> in the macro definition of the extended <code>incr!</code>
differs from the role in our previous use of <code>begin</code>.  Here it is used
to solve the problem that the template that prescribes the macro
output has to be a single form.
</p>

<p>
One can also write the multi-variable <code>incr!</code> macro without the
ellipsis by letting the macro expand into itself.  This is not
necessarily how one would do it, but here it serves as a demonstration
for further macro techniques:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">incr!</span>
  (<span style="color: #a020f0;">syntax-rules</span> ()
    ((incr!)
     (values))
    ((incr! x . x*)
     (<span style="color: #a020f0;">begin</span>
       (<span style="color: #a020f0;">set!</span> x (+ x 1))
       (incr! . x*)))))
</pre>
</div>

<p>
First of all, this is our first macro with two transcription <i>rules</i>,
where each rule consists of a pattern and of a template.  The pattern
of the first rule is <code>(incr!)</code>, the pattern of the second rule is
<code>(incr! x . x*)</code>.  Scheme's macro expander tries to match the macro
input against the patterns in the order in which the patterns appear
in the <code>syntax-rules</code> form.
</p>

<p>
The second new thing is a a pattern of the form <code>(incr! x . x*)</code>,
which matches an (improper) list of at least two elements, the first
being the macro keyword and the second one being bound to the pattern
variable <code>x</code>.  The rest arguments are bound as an (improper) list to
the pattern variable <code>x*</code>.
</p>

<p>
Finally, this example demonstrates a recursive macro, that is a macro
that transforms the input into an instance of itself.  As long as the
output of a macro use involves a new macro use (possibly with the same
keyword), the Scheme expander continues with transcribing the macro.
</p>

<p>
Let us not forget to test the new version of the macro:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> 100)
(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">y</span> 200)
(incr! x y)
(list x y)
</pre>
</div>

<pre class="example" id="org57c7dfb">
(101 201)
</pre>
</div>
</div>
