README.org
** Accessing vector locations through variables

A /vector/ in Scheme is a collection of locations in the store that
can be linearly addressed.  A new vector can be allocated with the
~vector~ procedure:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (define v (vector 1 2 3))
  v
#+END_SRC

#+RESULTS:
#+begin_example
#(1 2 3)
#+end_example

Vector elements can be retrieved using ~vector-ref~ and mutated using ~vector-set!~:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (vector-ref v 2)
#+END_SRC

#+RESULTS:
#+begin_example
3
#+end_example

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (vector-set! v 1 4)
  v
#+END_SRC

#+RESULTS:
#+begin_example
#(1 4 3)
#+end_example

Assume that we want to use our ~incr!~ macro to increase the value of
one vector element.  As ~incr!~ expects a variable as its argument, we
have make the locations associated to a vector accessible as if they
were backed up by a variable.  Another feature of the (R6RS) macro
system comes to our rescue:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (define-syntax v1
    (identifier-syntax
     [v1 (vector-ref v 1)]
     [(set! v1 expr) (vector-set! v 1 expr)]))
  (incr! v1)
  v
#+END_SRC

#+RESULTS:
#+begin_example
#(1 6 3)
#+end_example

This macro isn't written with ~syntax-rules~ but uses
~identifier-syntax~.  This is used to declare a keyword, ~v1~ in our
case, that is transcribed differently, depending on whether it appears
in the form ~v1~ or in the form ~(set! v1 expr)~ in the source code.

To access the zeroth or the second element of the vector ~v~, we could
define identifier macros ~v0~ and ~v2~ similar to ~v1~ but this would
mean mostly duplicating code and violating the DRY principle.  A
better approach is to use the Scheme macro system once more.  We
define a macro that, when used, defines a customized macro[fn:6]:

#+BEGIN_SRC scheme :results silent
  (define-syntax define-vector-reference
    (syntax-rules ()
      [(define-vector-reference var vec-expr idx-expr)
       (begin
         (define vec vec-expr)
         (define idx idx-expr)
         (define-syntax var
           (identifier-syntax
            [var (vector-ref vec idx)]
            [(set! var expr) (vector-set! vec idx expr)])))]))
#+END_SRC

We can now use this macro as follows:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (define-vector-reference initial-element v 0)
  (incr! initial-element)
  v
#+END_SRC

#+RESULTS:
#+begin_example
#(2 6 3)
#+end_example

Note that the arguments ~vec-expr~ and ~idx-expr~ can stand for
arbitrary expressions.  We evaluate these expressions once and store
their values in the variables ~vec~ and ~idx~ (which will be suitably
renamed by the macro expander so that they won't clash with user
defined identifiers with the same name).  If we didn't do this but
used ~vec-expr~ and ~idx-expr~ everywhere in place where ~vec~ and
~idx~ appeared in the defined macro, the vector and the index
expressions would be evaluated every time, the vector reference
variable would be accessed.

* Syntax objects

The Scheme reports define hygiene and referential transparency for
macros as follows:

- If a macro transformer inserts a binding for an identifier (variable
  or keyword) not appearing in the macro use, the identifier is in
  effect rename throughout its scope to avoid conflicts with other
  identifiers.

- If a macro transformer inserts a free reference to an identifier,
  the reference refers to the binding that was visible where the
  transformer was specified, regardless of any local bindings that may
  surround the use of the macro.

The examples of the previous section make it hopefully a bit clear
what is meant by these two points.  Nevertheless, one may think that
there still must be some magic at work and that it will be impossible
to prove anything about these macros.  The purpose of this section is
to disassemble everything and to explain what is going on under the
hood.

