README.html

<div id="outline-container-org45638a5" class="outline-3">
<h3 id="org45638a5"><span class="section-number-3">4.3.</span> Accessing vector locations through variables</h3>
<div class="outline-text-3" id="text-4-3">
<p>
A <i>vector</i> in Scheme is a collection of locations in the store that
can be linearly addressed.  A new vector can be allocated with the
<code>vector</code> procedure:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">v</span> (vector 1 2 3))
v
</pre>
</div>

<pre class="example" id="orgfb5f7f6">
#(1 2 3)
</pre>

<p>
Vector elements can be retrieved using <code>vector-ref</code> and mutated using <code>vector-set!</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(vector-ref v 2)
</pre>
</div>

<pre class="example" id="orgddfa75e">
3
</pre>

<div class="org-src-container">
<pre class="src src-scheme">(vector-set! v 1 4)
v
</pre>
</div>

<pre class="example" id="org263fa87">
#(1 4 3)
</pre>

<p>
Assume that we want to use our <code>incr!</code> macro to increase the value of
one vector element.  As <code>incr!</code> expects a variable as its argument, we
have make the locations associated to a vector accessible as if they
were backed up by a variable.  Another feature of the (R6RS) macro
system comes to our rescue:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">v1</span>
  (identifier-syntax
   [v1 (vector-ref v 1)]
   [(<span style="color: #a020f0;">set!</span> v1 expr) (vector-set! v 1 expr)]))
(incr! v1)
v
</pre>
</div>

<pre class="example" id="orgc1417d3">
#(1 5 3)
</pre>

<p>
This macro isn't written with <code>syntax-rules</code> but uses
<code>identifier-syntax</code>.  This is used to declare a keyword, <code>v1</code> in our
case, that is transcribed differently, depending on whether it appears
in the form <code>v1</code> or in the form <code>(set! v1 expr)</code> in the source code.
</p>

<p>
To access the zeroth or the second element of the vector <code>v</code>, we could
define identifier macros <code>v0</code> and <code>v2</code> similar to <code>v1</code> but this would
mean mostly duplicating code and violating the DRY principle.  A
better approach is to use the Scheme macro system once more.  We
define a macro that, when used, defines a customized macro<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">define-vector-reference</span>
  (<span style="color: #a020f0;">syntax-rules</span> ()
    [(define-vector-reference var vec-expr idx-expr)
     (<span style="color: #a020f0;">begin</span>
       (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">vec</span> vec-expr)
       (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">idx</span> idx-expr)
       (<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">var</span>
         (identifier-syntax
          [var (vector-ref vec idx)]
          [(<span style="color: #a020f0;">set!</span> var expr) (vector-set! vec idx expr)])))]))
</pre>
</div>

<p>
We can now use this macro as follows:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define-vector-reference initial-element v 0)
(incr! initial-element)
v
</pre>
</div>

<pre class="example" id="orgd663d51">
#(2 5 3)
</pre>

<p>
Note that the arguments <code>vec-expr</code> and <code>idx-expr</code> can stand for
arbitrary expressions.  We evaluate these expressions once and store
their values in the variables <code>vec</code> and <code>idx</code> (which will be suitably
renamed by the macro expander so that they won't clash with user
defined identifiers with the same name).  If we didn't do this but
used <code>vec-expr</code> and <code>idx-expr</code> everywhere in place where <code>vec</code> and
<code>idx</code> appeared in the defined macro, the vector and the index
expressions would be evaluated every time, the vector reference
variable would be accessed.
</p>
</div>
</div>
</div>

<div id="outline-container-org7f65354" class="outline-2">
<h2 id="org7f65354"><span class="section-number-2">5.</span> Syntax objects</h2>
<div class="outline-text-2" id="text-5">
<p>
The Scheme reports define hygiene and referential transparency for
macros as follows:
</p>

<ul class="org-ul">
<li>If a macro transformer inserts a binding for an identifier (variable
or keyword) not appearing in the macro use, the identifier is in
effect rename throughout its scope to avoid conflicts with other
identifiers.</li>

<li>If a macro transformer inserts a free reference to an identifier,
the reference refers to the binding that was visible where the
transformer was specified, regardless of any local bindings that may
surround the use of the macro.</li>
</ul>

<p>
The examples of the previous section make it hopefully a bit clear
what is meant by these two points.  Nevertheless, one may think that
there still must be some magic at work and that it will be impossible
to prove anything about these macros.  The purpose of this section is
to disassemble everything and to explain what is going on under the
hood.
</p>
</div>
