README.html

<div id="outline-container-org411e766" class="outline-3">
<h3 id="org411e766"><span class="section-number-3">5.1.</span> Identifiers</h3>
<div class="outline-text-3" id="text-5-1">
<p>
The Lisp languages, and thus Scheme as well, are homoiconic
programming languages, which means that if the program's internal
representation is a datum of the language.  In first approximation,
the internal representation of a Scheme expression (as of a Scheme
program) is a Scheme datum value.  For example, the program
(expression)
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([x 1])
  (+ x 2))
</pre>
</div>

<p>
is represented by a list whose first element is the symbol <code>let</code>,
whose second element is a list of a list with two elements and whose
third element is a list of the three data <code>+</code>, <code>x</code>, and <code>2</code>.
</p>

<p>
Due to existence of hygienic macros we have to amend this traditional
picture.  Consider the following example.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([<span style="color: #a020f0;">set!</span> 10])
  (incr! set!)
  set!)
</pre>
</div>

<p>
To evaluate the <code>let</code> expression, the macro use of <code>incr!</code> has to be
expanded first.  After the expansion, the expression would look like
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([<span style="color: #a020f0;">set!</span> 10])
  (<span style="color: #a020f0;">set!</span> set! (+ set! 1))
  set!)
</pre>
</div>

<p>
if Scheme expressions were represented by Scheme datum values and
within, identifiers were represented by symbols.  It is obvious that
this cannot be how the Scheme expander works because there would be no
way to tell which copy of the symbol <code>set!</code> refers to which binding.
The point is that identifiers cannot be represented by symbols, which
only have a symbolic name.  Instead, to an <i>identifier</i> both a
symbolic name and a lexical context are associated.  When the binding
of an identifier is looked up, it is looked up in the lexical context
associated with it.
</p>

<p>
In Scheme, symbols are first-class values.  The can be created using
the syntax <code>(quote name)</code>, which can be abbreviated to <code>'name</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">'red
</pre>
</div>

<pre class="example" id="org35172d8">
red
</pre>

<p>
The same is true for identifiers.  They are created just like symbols
but use the syntax <code>(syntax identifier)</code>, which can be abbreviated to
<code>#'identifier</code>, instead:
</p>

<div class="org-src-container">
<pre class="src src-scheme">#'x
</pre>
</div>

<pre class="example" id="orgb655d4b">
#&lt;syntax x&gt;
</pre>

<p>
(The format of the output, <code>#&lt;syntax x&gt;</code>, is implementation-specific,
because identifiers are not Scheme datum values and thus have no
standardized or faithful written representation.)
</p>

<p>
Evaluating of the form <code>(syntax x)</code> (or <code>#'x</code>) means the following for
the Scheme system: construct and return an identifier with the
symbolic name <code>x</code> and with the lexical context at the place of the <code>x</code>
appearing in the <code>syntax</code> form.  We have to be aware of that the term
<code>identifier</code> can be used in two (slightly) different contexts: When we
refer to <code>set!</code> as an identifier in the example above, we speak about
a token being part of the code.  When we refer to the expression <code>#'x</code>
evaluating to an identifier, we speak about a value of the language.
The expression <code>#'x</code> contains an identifier in the first sense
(speaking about the language) and evaluates to an identifier (as a
value of the language).
</p>

<p>
The procedure <code>syntax-&gt;datum</code> can be used to convert an identifier to
a symbol, namely its underlying symbolic name:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(syntax-&gt;datum #'x)
</pre>
</div>

<pre class="example" id="org81e7240">
x
</pre>

<p>
There are no standard procedures that allow us to look up the binding
of an identifier, but we can compare identifiers.  Scheme defines two
equivalence relations, realized by the predicates <code>bound-identifier=?</code>
and <code>free-identifier=?</code>.  Two identifiers are "<code>bound-identifier=?</code>"
if they are interchangeable when they appear bound in the output of a
macro.  Two identifiers are "<code>free-identifier=?</code>" if they are
interchangeable when they appear free in the output of a macro.
Neither equivalence implies the other.  It will become clearer in the
course of this tutorial what this means, but some experiments will
already give some understanding:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(list (bound-identifier=? #'x #'x) (bound-identifier=? #'x #'y))
</pre>
</div>

<pre class="example" id="orgee4e901">
(#t #f)
</pre>

<p>
The two identifiers to which the two evaluations of <code>#'x</code> in the first
argument to <code>list</code> evaluate are therefore "<code>bound-identifier=?</code>" while
the differently named identifiers <code>#'x</code> and <code>#'y</code> (more precisely: the
identifiers returned by these expressions) are not.  It is tempting to
say that the two (or three) instances of <code>#'x</code> evaluate to the <i>same</i>
identifier, but for this to make sense, some equivalence relation
would have had to be fixed earlier.
</p>

<p>
Let us now consider two simple examples for <code>free-identifier=?</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([x 1])
  (free-identifier=? #'x #'x))
</pre>
</div>

<pre class="example" id="org2d6942a">
#t
</pre>

<p>
If the identifiers to both instances of <code>#'x</code> evaluate were inserted
in the code as free identifiers they both would refer to the variable
binding of the identifier <code>x</code> introduced by <code>let</code>.
</p>

<p>
The second example is a bit more interesting:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([x 1]
      [y 1])
  (free-identifier=? #'x #'y))
</pre>
</div>

<pre class="example" id="orgf1c7ed9">
#f
</pre>

<p>
The answer is <code>#f</code> (for false) because although the values of the two
variables <code>x</code> and <code>y</code> are both initialized to <code>1</code> they are bound to
different locations in the store (which can be exhibited by mutating
one of the two variables.
</p>

<p>
So far, in all examples <code>bound-identifier=?</code> seems to give the same
result as <code>free-identifier=?</code>.  That this is not true is shown in the
next example.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([x 1])
  (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">outer-x</span> #'x)
  (<span style="color: #a020f0;">let</span> ([x 2])
    (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">inner-x</span> #'x)
    (list (bound-identifier=? outer-x inner-x)
          (free-identifier=? outer-x inner-x))))
</pre>
</div>

<pre class="example" id="org8aedaf8">
(#t #f)
</pre>

<p>
Inserting <code>inner-x</code> as a free identifier would not be equivalent to
inserting <code>outer-x</code> because the former would refer to the binding of
the variable with value <code>2</code> and the latter to the binding of the
variable with value <code>1</code>.  Thus identifiers that are
"<code>bound-identifier=?</code>" are not necessarily "<code>free-identifier</code>".  We
hope that the connection of <code>free-identifier=?</code> to the second hygiene
condition, the one about inserting free references to an identifier,
is apparent.
</p>

<p>
Again so far, it seems that identifiers are "<code>bound-identifier=?</code>" if
and only if they have the same symbolic name.  One implication is
correct, namely that identifiers that are interchangeable as bound identifiers
must have the same symbolic name, but the other implication is not.  To show this, we have to employ a macro:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([x 1])
  (<span style="color: #a020f0;">let-syntax</span>
      ([outer-x (identifier-syntax #'x)])
    (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">inner-x</span> #'x)
    (list (bound-identifier=? outer-x inner-x)
          (free-identifier=? outer-x inner-x))))
</pre>
</div>

<pre class="example" id="org0ab3999">
(#f #t)
</pre>

<p>
Two remarks about the example code are in order before we discuss the
result.  The binding form <code>let-syntax</code> is to <code>let</code> as <code>define-syntax</code>
is to <code>define</code>; in other words, it allows us to locally bind keywords
to macro (transformers).  Furthermore, we employ a short form of
<code>identifier-syntax</code> here, which defines no <code>set!</code> semantics but just
replaces an occurrence of the keyword <code>outer-x</code> with <code>#'x</code>.
</p>

<p>
Both the identifier <code>x</code> in the definition of the macro <code>outer-x</code> and
the identifier <code>x</code> in the definition of the variable <code>inner-x</code> refer
to the binding of <code>x</code> introduced by the outer <code>let</code>, which explains
that the values of <code>outer-x</code> and <code>inner-x</code> are "<code>free-identifier=?</code>".
But they are not "<code>bound-identifier=?</code>", so this example shows that
identifiers that "<code>free-identifier=?</code>" need not necessarily be
"<code>bound-identifier=?</code>".
</p>

<p>
The reason why they cannot be "<code>bound-identifier=?</code>" is that the first
hygiene condition about inserting bindings for an identifier would be
violated otherwise.  Consider the following example:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let-syntax</span>
    ([add1
      (<span style="color: #a020f0;">syntax-rules</span> ()
        [(add1 y)
         (<span style="color: #a020f0;">let</span> ([x 1])
           (+ x y))])])
  (<span style="color: #a020f0;">let</span> ([x 2])
    (add1 x)))
</pre>
</div>

<pre class="example" id="org779459a">
3
</pre>

<p>
The identifier <code>x</code> appearing in the macro template is inserted as a
bound identifier in the macro output and thus is in effect renamed to
avoid conflict with the identifier <code>x</code> appearing in the macro use.
Renaming means that the two identifiers named <code>x</code> cannot be
"<code>bound-identifier=?</code>" because they would otherwise be interchangeable
as bound identifiers.
</p>

<p>
Scheme implements this hygiene condition by assigning to identifiers
besides their symbolic name and their lexical context another
property, namely their historic context (or just history)<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup>.  The
history of an identifier is the information when the identifier was
first introduced in the program.  All identifiers in the program
source have the same history &#x2014; they were already there when the
program was started.  An identifier introduced by a macro
transformation (as part of its output) has a different history than
identifiers that were already present in the program source.
Identifiers introduced by different macro transformations have
different histories and all identifiers introduced by the same macro
transformation have the same history.
</p>

<p>
Let us take another view at this example:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([x 1])
  (<span style="color: #a020f0;">let-syntax</span>
      ([outer-x (identifier-syntax #'x)])
    (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">inner-x</span> #'x)
    (list (bound-identifier=? outer-x inner-x)
          (free-identifier=? outer-x inner-x))))
</pre>
</div>

<pre class="example" id="orgb593e4e">
(#f #t)
</pre>

<p>
The identifier <code>x</code> appears three times in the source.  All three
identifiers have the same history.  When the macro <code>outer-x</code> is
expanded, the identifier <code>x</code> is introduced in the macro output (as
part of the expression <code>#'x</code>) and this particular identifier was not
part of the macro input, so the introduced identifier <code>x</code> has a
different history than the identifier to which <code>inner-x</code> is bound.
</p>

<p>
We are now in a situation to give alternative definitions for
<code>bound-identifier=?</code> and <code>free-identifier=?</code>: Two identifiers are
"<code>bound-identifier=?</code>" if they have the same symbolic name and the
same history.  Two identifiers are "<code>free-identifier=?</code>" if they refer
to the same binding in their respective lexical contexts.  (An unbound
identifier is, by definition, "<code>free-identifier=?</code>" to another
identifier if the other identifier is also unbound and has the same
symbolic name.)
</p>

<p>
Scheme also allows to fudge identifiers.  The procedure
<code>datum-&gt;syntax</code> can turn a symbol into an identifier with that
symbolic name.  For that, the user has to provide a lexical context
and a history.  This is done by giving a "template" identifier from
which the context is taken.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([x 1])
  (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">outer-x</span> #'x)
  (<span style="color: #a020f0;">let</span> ([x 2])
    (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">outer</span> (datum-&gt;syntax outer-x 'x))
    (list (bound-identifier=? outer-x outer)
          (free-identifier=? outer-x outer))))
</pre>
</div>

<pre class="example" id="orga0bc9e9">
(#t #t)
</pre>

<p>
In this example, the identifier <code>outer</code> is an identifier with the
symbolic name <code>x</code> and with the context as if it was introduced where
<code>x</code> appears in the definition of <code>outer-x</code>.
</p>

<p>
In the following example, the fudged identifier with the symbolic name
<code>y</code> has the same history as the identifier <code>x</code> appearing the macro use
of <code>as-y</code>, and thus the same history as the identifier <code>y</code> appearing
in the call to <code>bound-identifier=?</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let-syntax</span>
    ([as-y
      (<span style="color: #a020f0;">syntax-rules</span> ()
        [(as-y x) (datum-&gt;syntax #'x 'y)])])
  (bound-identifier=? #'y (as-y x)))
</pre>
</div>

<pre class="example" id="org99f3d58">
#t
</pre>
</div>
</div>
