README.org
** Constructing syntax objects

In the previous section we learned that Scheme code cannot be
represented by a Scheme datum value (a Scheme value that has a written
representation like a list, a number, or a symbol), at least not
during the expansion process, as identifiers cannot be represented by
symbols.

The objects that do represent Scheme forms are called /syntax
objects/.  The basic idea is that a syntax object is like a datum
value but with identifiers instead of symbols.  So a list of
identifiers or a vector of a number and an identifier, or a single
string or identifier are all syntax objects.  Moreover, there can be a
/wrap/ around a nonidentifier syntax object.

Formally, syntax objects can inductively be defined as follows:

- A nonpair, nonvector, or nonsymbol value is a syntax object.
- A pair of syntax objects is a syntax object.
- A vector of syntax objects is a syntax object.
- An identifier is a syntax object.
- A wrapped nonpair, nonvector, or nonsymbol value is a syntax object.
- A wrapped pair or vector of syntax objects is a syntax object.

To each syntax object corresponds a (datum) value by stripping all
wraps and converting all identifiers to their symbolic names.  The
Scheme procedure that does this conversion is ~syntax->datum~.  We
have already seen it converting identifiers to symbols.  It is also
used in effect by the ~quote~ special form: When Scheme evaluates an
expression like ~(quote (1 2 foo))~, the (internal) procedure
responsible for expanding or evaluating this expression will receive a
syntax object whose underlying datum value is ~(1 2 foo)~ and will
evaluate to this underlying value.

We can construct the syntax object in the above example as a Scheme value:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (list 1 2 #'foo)
#+END_SRC

#+RESULTS:
#+begin_example
(1 2 #<syntax foo>)
#+end_example

It is a syntax object because it is a list of syntax objects (and
Scheme lists are built from pairs and the empty list) and it has the
expected corresponding (datum) value:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (syntax->datum (list 1 2 #'foo))
#+END_SRC

#+RESULTS:
#+begin_example
(1 2 foo)
#+end_example

The predicate ~identifier?~ is a Scheme procedure that can be used to
test whether a syntax object is an identifier or not:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (list (identifier? 1) (identifier? (list #'x)) (identifier? #'x))
#+END_SRC

#+RESULTS:
#+begin_example
(#f #f #t)
#+end_example

In the previous section, we saw how to use ~syntax~ keyword
(abbreviated by ~#'~) can be used to create identifiers.  In fact, the
argument to the ~syntax~ keyword does not have to be symbol but can be
any datum, so a ~syntax~ expression can be used to build more
complicated syntax objects:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (syntax (1 2 foo))
#+END_SRC

#+RESULTS:
#+begin_example
#<syntax (1 2 foo)>
#+end_example

As the result shows, this is a wrapped syntax object, namely a wrapped
list (of syntax objects).  The Scheme system uses the wrap to attach
source location information to the syntax object (facilitating
debugging), and the expander makes use of the fact that syntax objects
can be opaque (wrapped) to provide optimal algorithmic complexity for
the expansion process.

Whether wrapped or not, we can apply ~syntax->datum~ on this syntax object:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (syntax->datum #'(1 2 foo))
#+END_SRC

#+RESULTS:
#+begin_example
(1 2 foo)
#+end_example

Here, we used again the abbreviation ~#'~ for ~syntax~.

