README.html

<div id="outline-container-orgabd305d" class="outline-3">
<h3 id="orgabd305d"><span class="section-number-3">5.2.</span> Constructing syntax objects</h3>
<div class="outline-text-3" id="text-5-2">
<p>
In the previous section we learned that Scheme code cannot be
represented by a Scheme datum value (a Scheme value that has a written
representation like a list, a number, or a symbol), at least not
during the expansion process, as identifiers cannot be represented by
symbols.
</p>

<p>
The objects that do represent Scheme forms are called <i>syntax
objects</i>.  The basic idea is that a syntax object is like a datum
value but with identifiers instead of symbols.  So a list of
identifiers or a vector of a number and an identifier, or a single
string or identifier are all syntax objects.  Moreover, there can be a
<i>wrap</i> around a nonidentifier syntax object.
</p>

<p>
Formally, syntax objects can inductively be defined as follows:
</p>

<ul class="org-ul">
<li>A nonpair, nonvector, or nonsymbol value is a syntax object.</li>
<li>A pair of syntax objects is a syntax object.</li>
<li>A vector of syntax objects is a syntax object.</li>
<li>An identifier is a syntax object.</li>
<li>A wrapped nonpair, nonvector, or nonsymbol value is a syntax object.</li>
<li>A wrapped pair or vector of syntax objects is a syntax object.</li>
</ul>

<p>
To each syntax object corresponds a (datum) value by stripping all
wraps and converting all identifiers to their symbolic names.  The
Scheme procedure that does this conversion is <code>syntax-&gt;datum</code>.  We
have already seen it converting identifiers to symbols.  It is also
used in effect by the <code>quote</code> special form: When Scheme evaluates an
expression like <code>(quote (1 2 foo))</code>, the (internal) procedure
responsible for expanding or evaluating this expression will receive a
syntax object whose underlying datum value is <code>(1 2 foo)</code> and will
evaluate to this underlying value.
</p>

<p>
We can construct the syntax object in the above example as a Scheme value:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(list 1 2 #'foo)
</pre>
</div>

<pre class="example" id="orgc341733">
(1 2 #&lt;syntax foo&gt;)
</pre>

<p>
It is a syntax object because it is a list of syntax objects (and
Scheme lists are built from pairs and the empty list) and it has the
expected corresponding (datum) value:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(syntax-&gt;datum (list 1 2 #'foo))
</pre>
</div>

<pre class="example" id="org3c45042">
(1 2 foo)
</pre>

<p>
The predicate <code>identifier?</code> is a Scheme procedure that can be used to
test whether a syntax object is an identifier or not:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(list (identifier? 1) (identifier? (list #'x)) (identifier? #'x))
</pre>
</div>

<pre class="example" id="org327d581">
(#f #f #t)
</pre>

<p>
In the previous section, we saw how to use <code>syntax</code> keyword
(abbreviated by <code>#'</code>) can be used to create identifiers.  In fact, the
argument to the <code>syntax</code> keyword does not have to be symbol but can be
any datum, so a <code>syntax</code> expression can be used to build more
complicated syntax objects:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">syntax</span> (1 2 foo))
</pre>
</div>

<pre class="example" id="org3728ec9">
#&lt;syntax (1 2 foo)&gt;
</pre>

<p>
As the result shows, this is a wrapped syntax object, namely a wrapped
list (of syntax objects).  The Scheme system uses the wrap to attach
source location information to the syntax object (facilitating
debugging), and the expander makes use of the fact that syntax objects
can be opaque (wrapped) to provide optimal algorithmic complexity for
the expansion process.
</p>

<p>
Whether wrapped or not, we can apply <code>syntax-&gt;datum</code> on this syntax object:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(syntax-&gt;datum #'(1 2 foo))
</pre>
</div>

<pre class="example" id="org7504658">
(1 2 foo)
</pre>

<p>
Here, we used again the abbreviation <code>#'</code> for <code>syntax</code>.
</p>
</div>
</div>
