README.html

<div id="outline-container-orgcf186bb" class="outline-3">
<h3 id="orgcf186bb"><span class="section-number-3">5.3.</span> Destructing syntax objects</h3>
<div class="outline-text-3" id="text-5-3">
<p>
The syntax object returned by <code>#'(1 2 foo)</code> cannot be destructed using
list procedures like <code>car</code> and <code>cdr</code> although it represents a list as
it is wrapped.  Scheme offers a special form, <code>syntax-case</code> to
destruct syntax objects.  A <code>syntax-case</code> form contains clauses, each
consisting of a pattern of the form we already saw in connection with
<code>syntax-rules</code> and an expression.  An input syntax object is matched
against the patterns in order and the expression corresponding to the
first pattern that matches is evaluated:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">syntax-case</span> #'(1 2 foo) ()
  [(a b) 'case-1]
  [(a b (c d)) 'case-2]
  [(2 b c) 'case-3]
  [(a b c d e ...) 'case-4]
  [(a b c) 'case-5]
  [x 'case-6])
</pre>
</div>

<pre class="example" id="org8595a04">
case-5
</pre>

<p>
(The empty list <code>()</code> appearing in the second argument of <code>syntax-case</code>
will be explained soon and plays the same role as the empty list we
saw in our <code>syntax-rules</code> examples.)
</p>

<p>
The pattern of the last clause would have also matched but the
matching ends as soon as a matching clause (the fifth in this
example) is found.  (The system will raise an exception if no match
can be found.)
</p>

<p>
Let us try to distinguish the syntax objects returned by <code>#'(1 2 foo)</code> and <code>#'(1 2 bar)</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">syntax-case</span> #'(1 2 foo) ()
  [(a b bar) 'bar]
  [(a b foo) 'foo])
</pre>
</div>

<pre class="example" id="org6b9cfe3">
bar
</pre>

<p>
That we don't get the expected (or hoped for) result is because
<code>syntax-case</code> (as <code>syntax-rules</code>) does treat every identifier
appearing in a pattern as a pattern variable by default.  Thus, in the
first pattern, <code>bar</code> is not matched against <code>foo</code> but <code>bar</code> is bound
to <code>foo</code>.  We can change this behavior by adding the identifiers that
we want to match literally to the list that appeared as the empty list
so far:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">syntax-case</span> #'(1 2 foo) (bar foo)
  [(a b bar) 'bar]
  [(a b foo) 'foo])
</pre>
</div>

<pre class="example" id="orgcb2bdcb">
foo
</pre>

<p>
The equivalence predicate that <code>syntax-case</code> uses to compare an input
identifier against a literal identifier is <code>free-identifier=?</code>.  In
the case of the example, both <code>bar</code> and <code>foo</code> are unbound and we
recall that unbound identifiers are "<code>free-identifier=?</code>" if and only
if they have the same symbolic name.  The next example demonstrates
how the binding comes into play:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([foo 1])
  (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">input</span>
    (<span style="color: #a020f0;">let</span> ([foo 2])
      #'(1 2 foo)))
  (<span style="color: #a020f0;">syntax-case</span> input (foo)
    [(a b foo) 'match]
    [(a b c) 'no-match]))
</pre>
</div>

<pre class="example" id="orgc7273a1">
no-match
</pre>

<p>
We have now the tool to dispatch on the structure of a syntax object,
but what we also need is a way to get hold of the individual
components of a syntax object.  This is done with pattern variables
(<code>a</code>, <code>b</code>, and <code>c</code> in the example above).  We said above that a
pattern variable is bound to the syntax object it is matched against.
This scope of this binding is the expression following the pattern in
the <code>syntax-case</code> clause.  Just a keywords are not ordinary variables,
pattern variables are neither.  They may only be referenced inside the
<code>syntax</code> form as in the following example:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">syntax-case</span> #'(1 x) ()
  [(1 y) #'y])
</pre>
</div>

<pre class="example" id="org368530d">
#&lt;syntax x&gt;
</pre>

<p>
Here, <code>#'y</code> does not resolve to the identifier <code>y</code> (because <code>y</code> is
bound to a pattern variable) but to the syntax object to which <code>y</code> is
bound, which is the value of <code>#'(1 x)</code>.
</p>

<p>
Mixing of pattern variables and non-pattern variable identifiers in
the same <code>syntax</code> expression also works:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">syntax-case</span> #'(1 x) ()
  [(1 a) #'(b a)])
</pre>
</div>

<pre class="example" id="orgaadf488">
(#&lt;syntax b&gt; #&lt;syntax x&gt;)
</pre>

<p>
As one can see, the result is not a wrapped syntax object but a list
of two syntax objects.  This is no coincidence.  When a pattern
variable appears in a <code>syntax</code> template, all the substructure in which
the pattern variable is replaced by what it was matched against, is
unwrapped, so ordinary list and vector accessor procedures can be
used.  The following is another example:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">syntax-case</span> #'(1 2 3) ()
  [(1 x ...) #'(a x ... b c)])
</pre>
</div>

<pre class="example" id="orgdc844f6">
(#&lt;syntax a&gt; #&lt;syntax 2&gt; #&lt;syntax 3&gt; . #&lt;syntax (b c)&gt;)
</pre>

<p>
As can be seen, the pattern variable <code>x</code> is matched against the list
of syntax objects consisting of <code>2</code> and <code>3</code>.  Up to the part (and
including it) where <code>x</code> is substituted, the syntax object is
unwrapped.  The ellipsis in the <code>syntax</code> template works as the
ellipsis in the <code>syntax-rules</code> templates (we will see below why this
is no coincidence).
</p>

<p>
In particular, we can use list procedures to reference
individual elements or to calculate lengthes:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">syntax-length</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(x ...)
       (length #'(x ...))])))

(syntax-length #'(a b c d))
</pre>
</div>

<pre class="example" id="org8537af5">
4
</pre>

<p>
We have already seen how literals in <code>syntax-case</code> can be used for
literal matching of identifiers (using <code>free-identifier=?</code>).
Otherwise, <code>syntax-case</code> only matches per structure.  If we want to
match structural element using special rules, <i>fenders</i> can be used as
in the following example:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">syntax-case</span> #'(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">3</span> (+ 1 2)) ()
  [(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">id</span> expr)
   (identifier? #'id)
   'ok]
  [_ 'error])
</pre>
</div>

<pre class="example" id="org067ab0a">
error
</pre>

<p>
The fender is the expression between the pattern and the final
expression in the first clause of <code>syntax-rules</code>.  If present, it is
evaluated when the pattern matches.  If the evaluation yields <code>#f</code>,
this clause is skipped and matching is continued with the next clause.
The scope of the pattern variables of a pattern includes a fender if
present.
</p>

<p>
The (sub)pattern <code>_</code> matches anything (like a pattern variable) but
does not bind a pattern variable.
</p>
</div>
</div>
</div>

<div id="outline-container-org4e4fe76" class="outline-2">
<h2 id="org4e4fe76"><span class="section-number-2">6.</span> Syntax-case macros</h2>
<div class="outline-text-2" id="text-6">
</div>
