README.html
<div id="outline-container-orgf1e8c38" class="outline-3">
<h3 id="orgf1e8c38"><span class="section-number-3">6.1.</span> Macro transformers</h3>
<div class="outline-text-3" id="text-6-1">
<p>
We started this tutorial with writing macros and discussing a number
of some example of such macros.  Somehow, we seemed to have deviated
by talking about identifiers, syntax objects, and their construction
and destruction.  In this section we will see how <code>syntax-case</code> and
<code>syntax</code> can be employed to write powerful macros.  In fact, they are
the building blocks of macro transformers.
</p>

<p>
To make use of the forms <code>syntax-case</code> and <code>syntax</code>, we have to
understand what actually goes into a <code>define-syntax</code> definition.  The
general form of a syntax definition is <code>(define-syntax identifier
transformer-expression)</code> (the analogous holds for bindings in a
<code>let-syntax</code> expression).  When the Scheme expanders encounters a
<code>define-syntax</code> definition, it evaluates the <code>transformer-expression</code>,
which is an ordinary Scheme expression.  It's value must be a macro
transformer, which is then bound to the keyword given by <code>identifier</code>.
</p>

<p>
Now, a macro transformer is just an ordinary Scheme procedure taking
one argument, a syntax object, and returning one value, another syntax
object.  The input syntax object represents the macro use form, the
output syntax object represents the transcribed macro use.  Let us
check this:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([x 41])
  (<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">always-42</span>
    (<span style="color: #a020f0;">lambda</span> (stx)
      (<span style="color: #a020f0;">syntax</span> (+ 1 x))))

  (+ always-42
     (always-42 400)))
</pre>
</div>

<pre class="example" id="orgbd6936d">
84
</pre>

<p>
Independently of how the macro is used &#x2014; that is, independently of
what <code>stx</code> is &#x2014;, the macro transformer of this example always
returns the expression <code>(+ 1 x)</code> (evaluating to <code>42</code>).  Note that we
could have equivalently written <code>#'(+ 1 x)</code> instead of <code>syntax</code>.
</p>

<p>
If we want to make the macro output dependent on the macro input, we
have to employ <code>syntax-case</code> to destruct the input syntax object.  Let
us first define a macro transformer that uses <code>syntax-case</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">f</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(_ x ...)
       (list #'quote (list (length #'(x ...)) #'(x ...)))])))
</pre>
</div>

<p>
We can test this procedure as any other procedure:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(f #'(q a b c))
</pre>
</div>

<pre class="example" id="orgb42f8f7">
(#&lt;syntax quote&gt; (3 (#&lt;syntax a&gt; #&lt;syntax b&gt; #&lt;syntax c&gt;)))
</pre>

<p>
The output is thus a syntax object of the form <code>(quote (n x ...))</code>
where the <code>x</code> denote the arguments following the head element of the
syntax object argument to <code>f</code> and <code>n</code> is the number of these
arguments.  The expression that yields the syntax object in the
procedure <code>f</code> above is not very readable.  Because of that, Scheme
also offer a <code>quasisyntax</code> form (abbreviated with <code>#`</code>), which is to
<code>syntax</code> as <code>quasiquote</code> is to <code>quote</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">f</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(_ x ...)
       #`(quote (#,(length #'(x ...)) x ...))])))
</pre>
</div>

<p>
Even more readable becomes the expression if pattern variables are
used, which can not only be bound by <code>syntax-case</code> but also by
<code>with-syntax</code>, which is for pattern variables what <code>let</code> is for
ordinary variables:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">f</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(_ x ...)
       (with-syntax ([n (length #'(x ...))])
         #'(quote (n x ...)))])))
</pre>
</div>

<p>
In fact, <code>with-syntax</code> is not a primitive form but can be expressed in
terms of <code>syntax-case</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">with-syntax</span>
  (<span style="color: #a020f0;">syntax-rules</span> ()
    [(with-syntax ([p e0] ...) e1 ... e2)
     (<span style="color: #a020f0;">syntax-case</span> (list e0 ...) ()
       [(p ...)
        (<span style="color: #a020f0;">let</span> ()
          e1 ... e2)])]))
</pre>
</div>

<p>
In whatever way we write the procedure <code>f</code>, we can then use it to
define an actual macro:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">quote/length</span> f)
</pre>
</div>

<p>
Of course, instead of naming the macro transformer and just
referencing to it in the right hand side of <code>define-syntax</code>, we could
have equally well written the transformer procedure expression inline.
The advantage of the former is that the transformer procedure can then
be easily tested using the usual tools, the advantage of the latter is
that it is more compact<sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup>.
</p>

<p>
Let's test our macro:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(quote/length a b c)
</pre>
</div>

<pre class="example" id="orgb100b06">
(3 a b c)
</pre>

<p>
It should be noted that the calculation of the length, <code>3</code> in this
case, happens at expand-time (so in the compiler if we use one).  In
fact, a macro can be understood as a compiler for a sublanguage and
that is be plugged into the Scheme system to extend the language.
</p>

<p>
We now have amassed enough knowledge to give the definition of
<code>syntax-rules</code>.  As the right hand side of <code>define-syntax</code> expects a
procedure expression, a <code>syntax-rules</code> form must evaluate to a
procedure.  And, in fact, <code>syntax-rules</code> can be defined as follows:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">syntax-rules</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(_ (lit ...) [(k . p) t] ...)
       (for-all identifier? #'(lit ... k ...))
       #'(<span style="color: #a020f0;">lambda</span> (x)
           (<span style="color: #a020f0;">syntax-case</span> x (lit ...)
             [(_ . p) #'t] ...))])))
</pre>
</div>

<p>
The <code>syntax</code> expression following the fender of the <code>syntax-case</code>
clause shows that a <code>syntax-rules</code> expression evaluates to a
procedure.  There is another instance of <code>syntax</code> (<code>#'</code>) within the
template of the outer <code>syntax</code> expression.  This is because procedure
to which a <code>syntax-rules</code> expression evaluates outputs itself a syntax
object.
</p>

<p>
One more thing is remarkable:  Each <code>syntax-rules</code> pattern is of the
form <code>(k . p)</code>; more precisely, it can only match (syntax) pairs whose
head element is an identifier, that is macro uses of exactly this
form.  Notably, the pattern variable <code>k</code> isn't referenced in the
output.  This is because a <code>syntax-rules</code> pattern ignores the pattern
variable that corresponds to the keyword position.  In particular, the
following two syntax definitions are equivalent:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">incr!</span>
  (<span style="color: #a020f0;">syntax-rules</span> ()
    [(incr! x) (<span style="color: #a020f0;">set!</span> x (+ x 1))]))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">incr!</span>
  (<span style="color: #a020f0;">syntax-rules</span> ()
    [(_ x) (<span style="color: #a020f0;">set!</span> x (+ x 1))]))
</pre>
</div>

<p>
This is in contrast to a <code>syntax-case</code> expression, which doesn't tread
the keyword position in a special way.  This is the reason why we
often use <code>_</code> at the keyword position in <code>syntax-case</code> expressions for
macro transformers.
</p>

<p>
It is a good time to finally give the definition of our initial
<code>incr!</code> macro in terms of <code>syntax-case</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">incr!</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(_ x)
       (identifier? #'x)
       #'(<span style="color: #a020f0;">set!</span> x (+ x 1))])))
</pre>
</div>

<p>
It is instructive to go through the above definition of the
<code>syntax-rules</code> keyword and see how the earlier definition using
<code>syntax-rules</code> expands into the later definition using <code>syntax-case</code>.
The only line that is not present with the <code>syntax-rules</code> definition
is the fender <code>(identifier #'x)</code>, which has no equivalent for
<code>syntax-rules</code>.  This fender ensures that a syntax error is reported
early if the user tries to use this macro in a non-sensible form like
in <code>(incr! 2)</code>.
</p>
</div>
</div>
