README.org
** A fluid ~let~

We should finally move past the ~incr!~ macro.  We already remarked
that mutation (which ~incr!~ does) is frowned upon.  To be more
precise, what makes problems is mutation with unlimited extent.
Mutation with dynamic extent, on the other hand, can be used to
implement dynamically scoped variables, which are also called fluids
and do not have all the problems associated with unbound mutation.

It is probably best to explain it with an example.  For this, we
define a new binding-like construct, named ~fluid-let~[fn:9]:

#+BEGIN_SRC scheme :results silent
  (define-syntax fluid-let
    (lambda (stx)
      (syntax-case stx ()
        [(_ [(x e)] b1 ... b2)
         (identifier? #'x)
         #'(let ([y e])
             (define swap!
               (lambda ()
                 (let ([t x])
                   (set! x y)
                   (set! y t))))
             (dynamic-wind
               swap!
               (lambda ()
                 b1 ... b2)
               swap!))])))
#+END_SRC

Let us briefly check the output of the following expression:

#+BEGIN_SRC scheme :results output :export both :wrap example
  (let ([x 1])
    (define show
      (lambda ()
        (display x)
        (newline)))
    (show)
    (fluid-let ([x 2])
      (show))
    (show))
#+END_SRC

#+RESULTS:
#+begin_example
#+end_example

The ~dynamic-wind~ procedure takes three thunks (procedures that take
no arguments) as arguments.  When ~dynamic-wind~ is called, it calls
the three thunks in that order and finally returns the results of the
call to the second, the middle, thunk.  The reason why we didn't write
~(begin (swap!) ((lambda () b1 ... b2)) (swap!))~ is that
~dynamic-wind~ arranges for calling the enter and exit thunk even in
the presence of non-local control flow[fn:10].

The variable ~y~ is used by the macro to store the old value of ~var~
in it before the latter is mutated.  As ~y~ does not come from the
macro input, it won't conflict with the definition of an identifier
named ~y~ surrounding the use of ~fluid-let~.  Likewise, the temporary
variable ~t~ won't conflict regardless of what variable the pattern
variable ~x~ stands for.

Our ~fluid-let~ can "bind" exactly one variable.  If we want to change
more than value, say two, we have to rewrite our macro:

#+BEGIN_SRC scheme :results silent
  (define-syntax fluid-let
    (lambda (stx)
      (syntax-case stx ()
        [(_ [(x1 e1) (x2 e2)] b1 ... b2)
         (for-all identifier? #'(x1 x2))
         #'(let ([y1 e1] [y2 e2])
             (define swap!
               (lambda ()
                 (let ([t x1])
                   (set! x1 y1)
                   (set! y1 t))
                 (let ([t x2])
                   (set! x2 y2)
                   (set! y2 t))))
             (dynamic-wind
               swap!
               (lambda ()
                 b1 ... b2)
               swap!))])))
#+END_SRC

#+BEGIN_SRC scheme :results output :export both :wrap example
  (let ([a 1] [b 2])
    (define show
      (lambda ()
        (display (list a b))
        (newline)))
    (show)
    (fluid-let ([a 3] [b 4])
      (show))
    (show))
#+END_SRC

#+RESULTS:
#+begin_example
(1 2)
(3 4)
(1 2)
#+end_example

This is, of course, a non-solution because we still can't pass three
variables and have also lost the ability of just passing one
variable.  Possibly, the ellipsis can help as in the following
attempt:

#+BEGIN_SRC scheme :eval no
  (define-syntax fluid-let
    (lambda (stx)
      (syntax-case stx ()
        [(_ [(x e) ...] b1 ... b2)
         (for-all identifier? #'(x ...))
         #'(let ([y e] ...)
             (define swap!
               (lambda ()
                 (let ([t x])
                   (set! x y)
                   (set! y t))
                ...))
             (dynamic-wind
               swap!
               (lambda ()
                 b1 ... b2)
               swap!))])))
#+END_SRC

However, this won't quite work.  The problem is that there is only one
identifier ~y~ introduced and not one identifier per each fluid
variable.  The canonical solution Scheme offers here is the
~generate-temporaries~ procedure, which takes a list or a syntax
object representing a list and returns a list of as many identifiers,
each with its unique history so that they won't be pairwise
"~bound-identifier=?~" or to any other identifier:

#+BEGIN_SRC scheme :results scalar :export both :wrap example
  (with-syntax ([(x y) (generate-temporaries '(a b))])
    (list (identifier? #'x)
          (identifier? #'y)
          (bound-identifier=? #'x #'y)))
#+END_SRC

#+RESULTS:
#+begin_example
(#t #t #f)
#+end_example

Here, the list ~(a b)~ has two elements, so ~generate-temporaries~
creates two identifiers, which we bound using ~with-syntax~ to the
pattern variables ~x~ and ~y~.

With this tool at our disposal, we can finally write a version of
~fluid-let~ that works with an arbitrary number of variables:

#+BEGIN_SRC scheme :results silent
  (define-syntax fluid-let
    (lambda (stx)
      (syntax-case stx ()
        [(_ [(x e) ...] b1 ... b2)
         (for-all identifier? #'(x ...))
         (with-syntax
             ([(y ...) (generate-temporaries #'(x ...))])
           #'(let ([y e] ...)
               (define swap!
                 (lambda ()
                   (let ([t x])
                     (set! x y)
                     (set! y t))
                   ...))
               (dynamic-wind
                 swap!
                 (lambda ()
                   b1 ... b2)
                 swap!)))])))
#+END_SRC

#+BEGIN_SRC scheme :results output :export both :wrap example
  (let ([a 1] [b 2])
    (define show
      (lambda ()
        (display (list a b))
        (newline)))
    (show)
    (fluid-let ([a 3] [b 4])
      (show))
    (show))
#+END_SRC

#+RESULTS:
#+begin_example
(1 2)
(3 4)
(1 2)
#+end_example

