README.html

<div id="outline-container-org9ad4f08" class="outline-3">
<h3 id="org9ad4f08"><span class="section-number-3">6.2.</span> A fluid <code>let</code></h3>
<div class="outline-text-3" id="text-6-2">
<p>
We should finally move past the <code>incr!</code> macro.  We already remarked
that mutation (which <code>incr!</code> does) is frowned upon.  To be more
precise, what makes problems is mutation with unlimited extent.
Mutation with dynamic extent, on the other hand, can be used to
implement dynamically scoped variables, which are also called fluids
and do not have all the problems associated with unbound mutation.
</p>

<p>
It is probably best to explain it with an example.  For this, we
define a new binding-like construct, named <code>fluid-let</code><sup><a id="fnr.9" class="footref" href="#fn.9" role="doc-backlink">9</a></sup>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">fluid-let</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(_ [(x e)] b1 ... b2)
       (identifier? #'x)
       #'(<span style="color: #a020f0;">let</span> ([y e])
           (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">swap!</span>
             (<span style="color: #a020f0;">lambda</span> ()
               (<span style="color: #a020f0;">let</span> ([t x])
                 (<span style="color: #a020f0;">set!</span> x y)
                 (<span style="color: #a020f0;">set!</span> y t))))
           (dynamic-wind
             swap!
             (<span style="color: #a020f0;">lambda</span> ()
               b1 ... b2)
             swap!))])))
</pre>
</div>

<p>
Let us briefly check the output of the following expression:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([x 1])
  (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">show</span>
    (<span style="color: #a020f0;">lambda</span> ()
      (display x)
      (newline)))
  (show)
  (<span style="color: #a020f0;">fluid-let</span> ([x 2])
    (show))
  (show))
</pre>
</div>

<p>
The <code>dynamic-wind</code> procedure takes three thunks (procedures that take
no arguments) as arguments.  When <code>dynamic-wind</code> is called, it calls
the three thunks in that order and finally returns the results of the
call to the second, the middle, thunk.  The reason why we didn't write
<code>(begin (swap!) ((lambda () b1 ... b2)) (swap!))</code> is that
<code>dynamic-wind</code> arranges for calling the enter and exit thunk even in
the presence of non-local control flow<sup><a id="fnr.10" class="footref" href="#fn.10" role="doc-backlink">10</a></sup>.
</p>

<p>
The variable <code>y</code> is used by the macro to store the old value of <code>var</code>
in it before the latter is mutated.  As <code>y</code> does not come from the
macro input, it won't conflict with the definition of an identifier
named <code>y</code> surrounding the use of <code>fluid-let</code>.  Likewise, the temporary
variable <code>t</code> won't conflict regardless of what variable the pattern
variable <code>x</code> stands for.
</p>

<p>
Our <code>fluid-let</code> can "bind" exactly one variable.  If we want to change
more than value, say two, we have to rewrite our macro:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">fluid-let</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(_ [(x1 e1) (x2 e2)] b1 ... b2)
       (for-all identifier? #'(x1 x2))
       #'(<span style="color: #a020f0;">let</span> ([y1 e1] [y2 e2])
           (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">swap!</span>
             (<span style="color: #a020f0;">lambda</span> ()
               (<span style="color: #a020f0;">let</span> ([t x1])
                 (<span style="color: #a020f0;">set!</span> x1 y1)
                 (<span style="color: #a020f0;">set!</span> y1 t))
               (<span style="color: #a020f0;">let</span> ([t x2])
                 (<span style="color: #a020f0;">set!</span> x2 y2)
                 (<span style="color: #a020f0;">set!</span> y2 t))))
           (dynamic-wind
             swap!
             (<span style="color: #a020f0;">lambda</span> ()
               b1 ... b2)
             swap!))])))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([a 1] [b 2])
  (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">show</span>
    (<span style="color: #a020f0;">lambda</span> ()
      (display (list a b))
      (newline)))
  (show)
  (<span style="color: #a020f0;">fluid-let</span> ([a 3] [b 4])
    (show))
  (show))
</pre>
</div>

<p>
This is, of course, a non-solution because we still can't pass three
variables and have also lost the ability of just passing one
variable.  Possibly, the ellipsis can help as in the following
attempt:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">fluid-let</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(_ [(x e) ...] b1 ... b2)
       (for-all identifier? #'(x ...))
       #'(<span style="color: #a020f0;">let</span> ([y e] ...)
           (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">swap!</span>
             (<span style="color: #a020f0;">lambda</span> ()
               (<span style="color: #a020f0;">let</span> ([t x])
                 (<span style="color: #a020f0;">set!</span> x y)
                 (<span style="color: #a020f0;">set!</span> y t))
              ...))
           (dynamic-wind
             swap!
             (<span style="color: #a020f0;">lambda</span> ()
               b1 ... b2)
             swap!))])))
</pre>
</div>

<p>
However, this won't quite work.  The problem is that there is only one
identifier <code>y</code> introduced and not one identifier per each fluid
variable.  The canonical solution Scheme offers here is the
<code>generate-temporaries</code> procedure, which takes a list or a syntax
object representing a list and returns a list of as many identifiers,
each with its unique history so that they won't be pairwise
"<code>bound-identifier=?</code>" or to any other identifier:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(with-syntax ([(x y) (generate-temporaries '(a b))])
  (list (identifier? #'x)
        (identifier? #'y)
        (bound-identifier=? #'x #'y)))
</pre>
</div>

<p>
Here, the list <code>(a b)</code> has two elements, so <code>generate-temporaries</code>
creates two identifiers, which we bound using <code>with-syntax</code> to the
pattern variables <code>x</code> and <code>y</code>.
</p>

<p>
With this tool at our disposal, we can finally write a version of
<code>fluid-let</code> that works with an arbitrary number of variables:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">fluid-let</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(_ [(x e) ...] b1 ... b2)
       (for-all identifier? #'(x ...))
       (with-syntax
           ([(y ...) (generate-temporaries #'(x ...))])
         #'(<span style="color: #a020f0;">let</span> ([y e] ...)
             (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">swap!</span>
               (<span style="color: #a020f0;">lambda</span> ()
                 (<span style="color: #a020f0;">let</span> ([t x])
                   (<span style="color: #a020f0;">set!</span> x y)
                   (<span style="color: #a020f0;">set!</span> y t))
                 ...))
             (dynamic-wind
               swap!
               (<span style="color: #a020f0;">lambda</span> ()
                 b1 ... b2)
               swap!))]))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([a 1] [b 2])
  (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">show</span>
    (<span style="color: #a020f0;">lambda</span> ()
      (display (list a b))
      (newline)))
  (show)
  (<span style="color: #a020f0;">fluid-let</span> ([a 3] [b 4])
    (show))
  (show))
</pre>
</div>
</div>
</div>
