README.org
** Implementing a variant type in Scheme

It is time to demonstrate more involved macros to highlight some
features of the Scheme macro system and how it leads to extensibility
of the language.

To have some use case at hand, let us assume that we deal with binary
trees that carry a value at each (internal) node and at each leaf.  We
can use the Scheme record facility to provide the necessary data
types, implementing an abstract tree interface:

#+BEGIN_SRC scheme :results silent
  (define-record-type node (fields left value right))
  (define-record-type leaf (fields value))
#+END_SRC

We can build a tree using the constructors defined by the above
record-type definitions:

#+BEGIN_SRC scheme :results silent
  (define t
    (make-node
     (make-node (make-leaf 4) 2 (make-leaf 1))
     8
     (make-leaf -1)))
#+END_SRC

While creating a tree by hand in this way is doable, it is not very
neat.  It would be nice if we could give the tree above in simple,
parenthesized syntax as follows:
#+BEGIN_SRC scheme :eval no
  (((4)
    2
    (1))
   8
   (-1))
#+END_SRC

In other words, (internal) nodes are given by lists of three elements,
and leafs by lists of one element.  To achieve this, one might want to
write a procedure as the following one:

#+BEGIN_SRC scheme :results silent
  (define make-tree
    (lambda (e)
      (define n (length e))
      (cond
       [(= n 3)
        (make-node (make-tree (car e))
                   (cadr e)
                   (make-tree (caddr e)))]
       [(= n 1) (make-leaf (car e))]
       [else
        (assert #f)])))
#+END_SRC

We can then build our tree ~t~ as follows:

#+BEGIN_SRC scheme :results silent
  (define t
    (make-tree
     '(((4)
        2
        (1))
       8
       (-1))))
#+END_SRC

The ~quote~ (necessary so that Scheme does not try to evaluate our
tree description as an expression) is not optimal, but we can write a
macro that inserts the quote for us:

#+BEGIN_SRC scheme :results silent
  (define-syntax tree
    (syntax-rules ()
      [(tree datum)
       (make-tree 'datum)]))
#+END_SRC

With this macro, we can now build our tree with the following syntax:

#+BEGIN_SRC scheme :results silent
  (define t
    (tree
     (((4)
        2
        (1))
       8
       (-1))))
#+END_SRC

While this is optimal as far as the flexibility in syntax is
concerned, the solution is inferior to our original approach of
building the tree by calling the constructors ~make-node~ and
~make-leaf~ by hand.  The point is that the procedure ~make-tree~,
which is called in the output of the macro ~tree~, walks the tree
expression at run time and so is not as efficient as the original
approach.  What we want is that the tree expression is analyzed during
compile time.  As macros are nothing but small compilers, it is no
surprise that a macro will help.  All we have to do is to rewrite the
~tree~ macro that it doesn't output a call to ~make-tree~ but that it
directly outputs calls to ~make-node~ and ~make-leaf~:

#+BEGIN_SRC scheme :results silent
  (define-syntax tree
    (syntax-rules ()
      [(tree (left value right))
       (make-node (tree left) value (tree right))]
      [(tree (value))
       (make-leaf value)]))
#+END_SRC

The tree can be built as before:

#+BEGIN_SRC scheme :results silent
  (define t
    (tree
     (((4)
        2
        (1))
       8
       (-1))))
#+END_SRC

Now let us do something with the tree.  For example, we can ask for
the sum of all values in the tree nodes, internal and leaf nodes:

#+BEGIN_SRC scheme :results silent
  (define tree-accumulate
     (lambda (t)
       (cond
        [(node? t)
         (+ (tree-accumulate (node-left t))
            (node-value t)
            (tree-accumulate (node-right t)))]
        [(leaf? t)
         (leaf-value t)]
        [else (assert #f)])))
#+END_SRC

We can test the procedure with our example tree:

#+BEGIN_SRC scheme :results value :export both :wrap example
  (tree-accumulate t)
#+END_SRC

#+RESULTS:
#+begin_example
14
#+end_example

We have used Scheme's general ~cond~ expression to dispatch on the two
possible types of trees.  Compared to pattern matchers of other
languages, this also does not deserve the attribute neat.  What we
would like is to have a syntax so that we can write ~tree-accumulate~
as follows:

#+BEGIN_SRC scheme :eval no
  (define tree-accumulate
    (lambda (t)
      (tree-case t
       [(node left value right)
        (+ (tree-accumulate left)
           value
           (tree-accumulate right))]
       [(leaf value)
        value])))
#+END_SRC

Obviously, this calls for another macro!

#+BEGIN_SRC scheme :results silent
  (define-syntax tree-case
    (lambda (stx)
      (define parse-clause
        (lambda (cl)
          (syntax-case cl (node leaf)
            [[(node left value right) e1 ... e2]
             #'[(node? tmp)
                (let ([left (node-left tmp)]
                      [value (node-value tmp)]
                      [right (node-right tmp)])
                  e1 ... e2)]]
            [[(leaf value) e1 ... e2]
             #'[(leaf? tmp)
                (let ([value (leaf-value tmp)])
                  e1 ... e2)]]
            [_
             (syntax-violation 'tree-case "invalid clause syntax" stx cl)])))
      (syntax-case stx ()
        [(_ tree-expr clause ...)
         (with-syntax ([(clause ...)
                        (map parse-clause #'(clause ...))])
           #'(let ([tmp tree-expr])
               (unless (tree? tmp)
                 (assertion-violation 'tree-case "invalid tree argument" tmp))
               (cond
                clause ...
                [else
                 (assertion-violation 'tree-case "unhandled tree argument" tmp)])))]
        [_
         (syntax-violation 'tree-case "invalid syntax" stx)])))

  (define tree?
    (lambda (obj)
      (or (node? obj)
          (leaf? obj))))
#+END_SRC

In the above macro, we used the procedure ~syntax-violation~ defined
by Scheme to report syntax errors when the macro is misused.  It is
always a good idea to report syntax violations as early and as precise
as possible.

The two identifiers, the Scheme reports speak of /auxiliary syntax/,
~node~ and ~leaf~ are matched using ~free-identifier=?~.  Both of
these identifiers are bound (they were bound by our record-type
definitions of the ~node~ and the ~leaf~ type).  Thus, when the macro is used in the form
#+BEGIN_SRC :scheme :eval no
  (tree-case t
   [(n l v r) ---]
   ---)
#+END_SRC
the binding of the identifier ~n~ is compared to the binding of the
identifier ~node~ (in the lexical context of the macro transformer).

In general, it is a good idea to use bound identifiers as literals in
~syntax-case~ (or ~syntax-rules~).  Even if the code surrounding a
macro use of, say, ~tree-case~ binds ~node~ to something else, the
library system of Scheme allows to import another identifier that is
bound to the original binding of ~node~ so the ~tree-case~ macro can
still be used with the other identifier in place.  This does not work
when ~free-identifier=?~ compares unbound identifiers by name.

With our ~tree-case~ macro, we can finally define and test our newly
written ~tree-accumulate~:

#+BEGIN_SRC scheme :results value :exports both :wrap example
  (define tree-accumulate
    (lambda (t)
      (tree-case t
       [(node left value right)
        (+ (tree-accumulate left)
           value
           (tree-accumulate right))]
       [(leaf value)
        value])))

  (tree-accumulate t)
#+END_SRC

#+RESULTS:
#+begin_example
14
#+end_example

We have solved our binary-tree-use case but we can still do better.
Assume that the problem we have to solve the next day does not involve
binary trees but abstract syntax trees of a programming language, for
which we have to write an interpreter or compiler.  Instead of
(internal) nodes and leaves, we would have, say, expressions,
statements, definitions, programs.  When walking an abstract syntax
tree, one has to dispatch again on the possible types of an abstract
syntax tree.  So, instead of ~tree-case~ we want ~ast-case~.  We could
copy and suitably modify the ~tree-case~ macro but this would violate
DRY.

The answer is, instead, to write a macro, once and for all, that
generates macros like ~tree-case~.  Here it is:

#+BEGIN_SRC scheme :results silent
  (define-syntax define-destructor
    (lambda (stx)
      (syntax-case stx ()
        [(_ name [keyword predicate-expr accessor-expr ...] ...)
         (for-all identifier? #'(keyword ...))
         (with-syntax
             ([(pred-id ...)
               (generate-temporaries #'(predicate-expr ...))]
              [((acc-id ...) ...)
               (map generate-temporaries #'((accessor-expr ...) ...))]
              [((var ...) ...)
               (map generate-temporaries #'((accessor-expr ...) ...))])
           #'(begin
               (define pred-id predicate-expr) ...
               (define acc-id accessor-expr) ... ...
               (define-syntax name
                 (lambda (stx)
                   (define parse-clause
                     (lambda (cl)
                       (syntax-case cl (keyword ...)
                         [[(keyword var ...) e1 (... ...) e2]
                          #'[(pred-id tmp)
                             (let ([var (acc-id tmp)] ...)
                               e1 (... ...) e2)]]
                         ...
                         [_
                          (syntax-violation 'name "invalid clause syntax" stx cl)])))
                   (syntax-case stx ()
                     [(_ expr clause (... ...))
                      (with-syntax ([(clause (... ...))
                                     (map parse-clause #'(clause (... ...)))])
                        #'(let ([tmp expr])
                            (cond
                             clause (... ...)
                             [else
                              (assertion-violation 'name "unhandled argument" tmp)])))]
                     [_
                      (syntax-violation 'name "invalid syntax" stx)])))))]
        [_
         (syntax-violation 'define-destructor "invalid syntax" stx)])))
#+END_SRC

A few explanations are in order.  First of all, we see nested ellipses
in the code above.  Using ~syntax-case~ we can match a syntax object
of the form ~((a b c) (1 2))~ against a pattern of the form ~((x ...)
...)~.  The pattern variable ~x~ will then represent a list of two
lists; the first list will contain the elements ~a~, ~b~, and ~c~, the
second list will contain the elements ~1~ and ~2~.  In ~syntax~
templates, the pattern variable can be used as long as least two
ellipses follow.  For example, the template ~((x ...) ...)~ gives back
~((a b c) (1 2))~, while ~(x ... ...)~ gives ~(a b c 1 2)~.

We also have to explain the occurrences of ~(... ...)~.  In the
definition of ~define-destructor~, the outer syntax form has to
evaluate into a syntax object that contains ellipses, so we have to
keep the outer syntax form from interpreting these ellipses that
should be in the output syntax object, in other words, we have to
escape them.  The Scheme way of doing this, is to write ~(... x)~.  If
~syntax~ sees a sub-template like this one, it processes ~x~ and
returns the result but gives the ellipsis in ~x~ the status of an
ordinary identifier.

Coming back to our tree example, the ~define-destructor~ syntax can be
used as follows:

#+BEGIN_SRC scheme :results silent
  (define-destructor tree-case
    [node node? node-left node-value node-right]
    [leaf leaf? leaf-value])
#+END_SRC

Now we can redefine ~tree-accumulate~ and test it:

#+BEGIN_SRC scheme :results value :exports both :wrap example
  (define tree-accumulate
    (lambda (t)
      (tree-case t
       [(node left value right)
        (+ (tree-accumulate left)
           value
           (tree-accumulate right))]
       [(leaf value)
        value])))

  (tree-accumulate t)
#+END_SRC

#+RESULTS:
#+begin_example
14
#+end_example

