README.html

<div id="outline-container-org2a2cc89" class="outline-3">
<h3 id="org2a2cc89"><span class="section-number-3">6.3.</span> Implementing a variant type in Scheme</h3>
<div class="outline-text-3" id="text-6-3">
<p>
It is time to demonstrate more involved macros to highlight some
features of the Scheme macro system and how it leads to extensibility
of the language.
</p>

<p>
To have some use case at hand, let us assume that we deal with binary
trees that carry a value at each (internal) node and at each leaf.  We
can use the Scheme record facility to provide the necessary data
types, implementing an abstract tree interface:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-record-type</span> node (fields left value right))
(<span style="color: #a020f0;">define-record-type</span> leaf (fields value))
</pre>
</div>

<p>
We can build a tree using the constructors defined by the above
record-type definitions:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">t</span>
  (make-node
   (make-node (make-leaf 4) 2 (make-leaf 1))
   8
   (make-leaf -1)))
</pre>
</div>

<p>
While creating a tree by hand in this way is doable, it is not very
neat.  It would be nice if we could give the tree above in simple,
parenthesized syntax as follows:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(((4)
  2
  (1))
 8
 (-1))
</pre>
</div>

<p>
In other words, (internal) nodes are given by lists of three elements,
and leafs by lists of one element.  To achieve this, one might want to
write a procedure as the following one:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">make-tree</span>
  (<span style="color: #a020f0;">lambda</span> (e)
    (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">n</span> (length e))
    (<span style="color: #a020f0;">cond</span>
     [(= n 3)
      (make-node (make-tree (car e))
                 (cadr e)
                 (make-tree (caddr e)))]
     [(= n 1) (make-leaf (car e))]
     [<span style="color: #a020f0;">else</span>
      (assert #f)])))
</pre>
</div>

<p>
We can then build our tree <code>t</code> as follows:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">t</span>
  (make-tree
   '(((4)
      2
      (1))
     8
     (-1))))
</pre>
</div>

<p>
The <code>quote</code> (necessary so that Scheme does not try to evaluate our
tree description as an expression) is not optimal, but we can write a
macro that inserts the quote for us:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">tree</span>
  (<span style="color: #a020f0;">syntax-rules</span> ()
    [(tree datum)
     (make-tree 'datum)]))
</pre>
</div>

<p>
With this macro, we can now build our tree with the following syntax:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">t</span>
  (tree
   (((4)
      2
      (1))
     8
     (-1))))
</pre>
</div>

<p>
While this is optimal as far as the flexibility in syntax is
concerned, the solution is inferior to our original approach of
building the tree by calling the constructors <code>make-node</code> and
<code>make-leaf</code> by hand.  The point is that the procedure <code>make-tree</code>,
which is called in the output of the macro <code>tree</code>, walks the tree
expression at run time and so is not as efficient as the original
approach.  What we want is that the tree expression is analyzed during
compile time.  As macros are nothing but small compilers, it is no
surprise that a macro will help.  All we have to do is to rewrite the
<code>tree</code> macro that it doesn't output a call to <code>make-tree</code> but that it
directly outputs calls to <code>make-node</code> and <code>make-leaf</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">tree</span>
  (<span style="color: #a020f0;">syntax-rules</span> ()
    [(tree (left value right))
     (make-node (tree left) value (tree right))]
    [(tree (value))
     (make-leaf value)]))
</pre>
</div>

<p>
The tree can be built as before:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">t</span>
  (tree
   (((4)
      2
      (1))
     8
     (-1))))
</pre>
</div>

<p>
Now let us do something with the tree.  For example, we can ask for
the sum of all values in the tree nodes, internal and leaf nodes:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">tree-accumulate</span>
   (<span style="color: #a020f0;">lambda</span> (t)
     (<span style="color: #a020f0;">cond</span>
      [(node? t)
       (+ (tree-accumulate (node-left t))
          (node-value t)
          (tree-accumulate (node-right t)))]
      [(leaf? t)
       (leaf-value t)]
      [<span style="color: #a020f0;">else</span> (assert #f)])))
</pre>
</div>

<p>
We can test the procedure with our example tree:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(tree-accumulate t)
</pre>
</div>

<p>
We have used Scheme's general <code>cond</code> expression to dispatch on the two
possible types of trees.  Compared to pattern matchers of other
languages, this also does not deserve the attribute neat.  What we
would like is to have a syntax so that we can write <code>tree-accumulate</code>
as follows:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">tree-accumulate</span>
  (<span style="color: #a020f0;">lambda</span> (t)
    (tree-case t
     [(node left value right)
      (+ (tree-accumulate left)
         value
         (tree-accumulate right))]
     [(leaf value)
      value])))
</pre>
</div>

<p>
Obviously, this calls for another macro!
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">tree-case</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">parse-clause</span>
      (<span style="color: #a020f0;">lambda</span> (cl)
        (<span style="color: #a020f0;">syntax-case</span> cl (node leaf)
          [[(node left value right) e1 ... e2]
           #'[(node? tmp)
              (<span style="color: #a020f0;">let</span> ([left (node-left tmp)]
                    [value (node-value tmp)]
                    [right (node-right tmp)])
                e1 ... e2)]]
          [[(leaf value) e1 ... e2]
           #'[(leaf? tmp)
              (<span style="color: #a020f0;">let</span> ([value (leaf-value tmp)])
                e1 ... e2)]]
          [_
           (syntax-violation 'tree-case <span style="color: #8b2252;">"invalid clause syntax"</span> stx cl)])))
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(_ tree-expr clause ...)
       (with-syntax ([(clause ...)
                      (<span style="color: #a020f0;">map</span> parse-clause #'(clause ...))])
         #'(<span style="color: #a020f0;">let</span> ([tmp tree-expr])
             (<span style="color: #a020f0;">unless</span> (tree? tmp)
               (assertion-violation 'tree-case <span style="color: #8b2252;">"invalid tree argument"</span> tmp))
             (<span style="color: #a020f0;">cond</span>
              clause ...
              [<span style="color: #a020f0;">else</span>
               (assertion-violation 'tree-case <span style="color: #8b2252;">"unhandled tree argument"</span> tmp)])))]
      [_
       (syntax-violation 'tree-case <span style="color: #8b2252;">"invalid syntax"</span> stx)])))

(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">tree?</span>
  (<span style="color: #a020f0;">lambda</span> (obj)
    (<span style="color: #a020f0;">or</span> (node? obj)
        (leaf? obj))))
</pre>
</div>

<p>
In the above macro, we used the procedure <code>syntax-violation</code> defined
by Scheme to report syntax errors when the macro is misused.  It is
always a good idea to report syntax violations as early and as precise
as possible.
</p>

<p>
The two identifiers, the Scheme reports speak of <i>auxiliary syntax</i>,
<code>node</code> and <code>leaf</code> are matched using <code>free-identifier=?</code>.  Both of
these identifiers are bound (they were bound by our record-type
definitions of the <code>node</code> and the <code>leaf</code> type).  Thus, when the macro is used in the form
</p>
<div class="org-src-container">
<pre class="src src-:scheme">(tree-case t
 [(n l v r) ---]
 ---)
</pre>
</div>
<p>
the binding of the identifier <code>n</code> is compared to the binding of the
identifier <code>node</code> (in the lexical context of the macro transformer).
</p>

<p>
In general, it is a good idea to use bound identifiers as literals in
<code>syntax-case</code> (or <code>syntax-rules</code>).  Even if the code surrounding a
macro use of, say, <code>tree-case</code> binds <code>node</code> to something else, the
library system of Scheme allows to import another identifier that is
bound to the original binding of <code>node</code> so the <code>tree-case</code> macro can
still be used with the other identifier in place.  This does not work
when <code>free-identifier=?</code> compares unbound identifiers by name.
</p>

<p>
With our <code>tree-case</code> macro, we can finally define and test our newly
written <code>tree-accumulate</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">tree-accumulate</span>
  (<span style="color: #a020f0;">lambda</span> (t)
    (tree-case t
     [(node left value right)
      (+ (tree-accumulate left)
         value
         (tree-accumulate right))]
     [(leaf value)
      value])))

(tree-accumulate t)
</pre>
</div>

<pre class="example" id="orgfc7e2c0">
14
</pre>

<p>
We have solved our binary-tree-use case but we can still do better.
Assume that the problem we have to solve the next day does not involve
binary trees but abstract syntax trees of a programming language, for
which we have to write an interpreter or compiler.  Instead of
(internal) nodes and leaves, we would have, say, expressions,
statements, definitions, programs.  When walking an abstract syntax
tree, one has to dispatch again on the possible types of an abstract
syntax tree.  So, instead of <code>tree-case</code> we want <code>ast-case</code>.  We could
copy and suitably modify the <code>tree-case</code> macro but this would violate
DRY.
</p>

<p>
The answer is, instead, to write a macro, once and for all, that
generates macros like <code>tree-case</code>.  Here it is:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">define-destructor</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(_ name [keyword predicate-expr accessor-expr ...] ...)
       (for-all identifier? #'(keyword ...))
       (with-syntax
           ([(pred-id ...)
             (generate-temporaries #'(predicate-expr ...))]
            [((acc-id ...) ...)
             (<span style="color: #a020f0;">map</span> generate-temporaries #'((accessor-expr ...) ...))]
            [((var ...) ...)
             (<span style="color: #a020f0;">map</span> generate-temporaries #'((accessor-expr ...) ...))])
         #'(<span style="color: #a020f0;">begin</span>
             (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">pred-id</span> predicate-expr) ...
             (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">acc-id</span> accessor-expr) ... ...
             (<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">name</span>
               (<span style="color: #a020f0;">lambda</span> (stx)
                 (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">parse-clause</span>
                   (<span style="color: #a020f0;">lambda</span> (cl)
                     (<span style="color: #a020f0;">syntax-case</span> cl (keyword ...)
                       [[(keyword var ...) e1 (... ...) e2]
                        #'[(pred-id tmp)
                           (<span style="color: #a020f0;">let</span> ([var (acc-id tmp)] ...)
                             e1 (... ...) e2)]]
                       ...
                       [_
                        (syntax-violation 'name <span style="color: #8b2252;">"invalid clause syntax"</span> stx cl)])))
                 (<span style="color: #a020f0;">syntax-case</span> stx ()
                   [(_ expr clause (... ...))
                    (with-syntax ([(clause (... ...))
                                   (<span style="color: #a020f0;">map</span> parse-clause #'(clause (... ...)))])
                      #'(<span style="color: #a020f0;">let</span> ([tmp expr])
                          (<span style="color: #a020f0;">cond</span>
                           clause (... ...)
                           [<span style="color: #a020f0;">else</span>
                            (assertion-violation 'name <span style="color: #8b2252;">"unhandled argument"</span> tmp)])))]
                   [_
                    (syntax-violation 'name <span style="color: #8b2252;">"invalid syntax"</span> stx)])))))]
      [_
       (syntax-violation 'define-destructor <span style="color: #8b2252;">"invalid syntax"</span> stx)])))
</pre>
</div>

<p>
A few explanations are in order.  First of all, we see nested ellipses
in the code above.  Using <code>syntax-case</code> we can match a syntax object
of the form <code>((a b c) (1 2))</code> against a pattern of the form <code>((x ...)
...)</code>.  The pattern variable <code>x</code> will then represent a list of two
lists; the first list will contain the elements <code>a</code>, <code>b</code>, and <code>c</code>, the
second list will contain the elements <code>1</code> and <code>2</code>.  In <code>syntax</code>
templates, the pattern variable can be used as long as least two
ellipses follow.  For example, the template <code>((x ...) ...)</code> gives back
<code>((a b c) (1 2))</code>, while <code>(x ... ...)</code> gives <code>(a b c 1 2)</code>.
</p>

<p>
We also have to explain the occurrences of <code>(... ...)</code>.  In the
definition of <code>define-destructor</code>, the outer syntax form has to
evaluate into a syntax object that contains ellipses, so we have to
keep the outer syntax form from interpreting these ellipses that
should be in the output syntax object, in other words, we have to
escape them.  The Scheme way of doing this, is to write <code>(... x)</code>.  If
<code>syntax</code> sees a sub-template like this one, it processes <code>x</code> and
returns the result but gives the ellipsis in <code>x</code> the status of an
ordinary identifier.
</p>

<p>
Coming back to our tree example, the <code>define-destructor</code> syntax can be
used as follows:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define-destructor tree-case
  [node node? node-left node-value node-right]
  [leaf leaf? leaf-value])
</pre>
</div>

<p>
Now we can redefine <code>tree-accumulate</code> and test it:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">tree-accumulate</span>
  (<span style="color: #a020f0;">lambda</span> (t)
    (tree-case t
     [(node left value right)
      (+ (tree-accumulate left)
         value
         (tree-accumulate right))]
     [(leaf value)
      value])))

(tree-accumulate t)
</pre>
</div>

<pre class="example" id="orgc285730">
14
</pre>
</div>
</div>
</div>
