README.html

<div id="outline-container-orgf67db64" class="outline-2">
<h2 id="orgf67db64"><span class="section-number-2">7.</span> Breaking hygiene</h2>
<div class="outline-text-2" id="text-7">
<p>
Scheme macros written with <code>syntax-rules</code> are hygienic.  This is also
true by default for macros written with the more general
<code>syntax-case~/~syntax</code> combination.  Hygiene &#x2014; although it may take
some time to understand &#x2014; is one of the selling points of Scheme
macros and one (of many) reasons why Scheme macros are so more
powerful than, say, macros in C or even in Common Lisp.
</p>

<p>
Sometimes, however, we want to break hygiene explicitely.  We give a
number of concrete examples:
</p>
</div>

<div id="outline-container-org020a5a3" class="outline-3">
<h3 id="org020a5a3"><span class="section-number-3">7.1.</span> A classical loop macro</h3>
<div class="outline-text-3" id="text-7-1">
<p>
A classical example for this is a <code>loop</code> macro that provides a loop
that evaluates the code enclosed in it repeatedly until a
corresponding <code>break</code> command is evaluated.  A typical use looks like
the following (again, not necessarily a good example for functional
programming!):
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([i 0])
  (loop
    (<span style="color: #a020f0;">when</span> (= i 5)
      (break))
    (display i)
    (newline)
    (incr! i)))
</pre>
</div>

<p>
Our first attempt to implement the <code>loop</code> construct with a macro is
the following syntax definition:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">loop</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(_ e ...)
       #'(<span style="color: #a020f0;">call-with-current-continuation</span>
          (<span style="color: #a020f0;">lambda</span> (break)
            (<span style="color: #a020f0;">let</span> <span style="color: #0000ff;">f</span> ()
              e ...
              (f))))])))
</pre>
</div>

<p>
Here we make use of the fact that Scheme has first-class
continuations.  The call to <code>call-with-current-continuation</code> captures
the continuation of the named <code>let</code> expression.
</p>

<p>
Nevertheless, our example code that is supposed to print the numbers
zero to four won't work with this version of the <code>loop</code> keyword.  Our
Scheme system will tell us that <code>break</code> is an undefined identifier (or
refer to a predefined top-level identifier with this name).  Although,
it won't say that, but hygiene is to be blamed for it.
</p>

<p>
As the identifier <code>break</code> bound in the output of <code>loop</code> does not
come from the input of the <code>loop</code> form, it has a different history
than the identifier <code>break</code> appearing in the body of the loop form.
Identifiers with different histories do not shadow each other, so the
<code>break</code> in the loop body cannot reference the binding of <code>break</code>
coming from the template in the <code>loop</code> macro.
</p>

<p>
One way to solve it is to provide <code>break</code> as an explicit argument to
the loop macro (we put a star to the name to mark the new syntax):
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">loop*</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(_ break e ...)
       #'(<span style="color: #a020f0;">call-with-current-continuation</span>
          (<span style="color: #a020f0;">lambda</span> (break)
            (<span style="color: #a020f0;">let</span> <span style="color: #0000ff;">f</span> ()
              e ...
              (f))))])))
</pre>
</div>

<p>
With this modification, everything works:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([i 0])
  (loop* break
    (<span style="color: #a020f0;">when</span> (= i 5)
      (break))
    (display i)
    (newline)
    (incr! i)))
</pre>
</div>

<p>
This solution has one more advantage besides that it actually works
&#x2014; it allows us to specify the name we want to use for the expression
breaking out of the loop.  For example, it allows us to easily nest two of
the loops:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([i 0])
  (loop* break-outer
    (loop* break-inner
      (<span style="color: #a020f0;">when</span> (= i 5)
        (break-outer))
      (<span style="color: #a020f0;">when</span> (= i 2)
        (break-inner))
      (display i)
      (newline)
      (incr! i))
    (display <span style="color: #8b2252;">"-\n"</span>)
    (incr! i)))
</pre>
</div>

<p>
(Note how hygiene again helps to make this possible.  Both macro
instances bind the identifier <code>f</code>, but the occurrences of <code>f</code>
correspond to different histories so they don't shadow each other.)
</p>

<p>
While the version with an explicit <code>break</code> argument to the <code>loop*</code>
macro has its advantages, sometimes we still may want the more terse
syntax with an implicit <code>break</code> parameter.  To make our original
version of <code>loop</code> work, we must not introduce a <code>break</code> identifier
with a different history.  Instead, we must output <code>break</code> as if it
appeared as an argument to the macro use.  In other words, we have to
forge an identifier and <code>datum-&gt;syntax</code> was the tool to do this:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">loop</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(k e ...)
       (with-syntax ([break (datum-&gt;syntax #'k 'break)])
         #'(<span style="color: #a020f0;">call-with-current-continuation</span>
            (<span style="color: #a020f0;">lambda</span> (break)
              (<span style="color: #a020f0;">let</span> <span style="color: #0000ff;">f</span> ()
                e ...
                (f)))))])))
</pre>
</div>

<p>
Here, for the first time, we make use of the keyword identifier of the
macro use, which we bound to the pattern variable <code>k</code>.  The call to
<code>datum-&gt;syntax</code> then returns an identifier named <code>break</code> as if it
appears where the macro use keyword appears, that is with the same
history and the same lexical context.
</p>

<p>
Let us test our example with this new version!
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([i 0])
  (loop
    (<span style="color: #a020f0;">when</span> (= i 5)
      (break))
    (display i)
    (newline)
    (incr! i)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org727c9de" class="outline-3">
<h3 id="org727c9de"><span class="section-number-3">7.2.</span> Convenience syntax to bind implicit identifiers</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Above, we used the <code>datum-&gt;syntax</code> procedure together with
<code>with-syntax</code> explicitly to inject an identifier as if it appeared at
the macro use site into the template.  Chez Scheme provides a
syntactic form <code>with-implicit</code> that abstracts from this low-level
approach.  While the <code>with-implicit</code> form is non-standard, thanks to
Scheme's macro system we can define it in any standard system:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">with-implicit</span>
  (<span style="color: #a020f0;">lambda</span> (x)
    (<span style="color: #a020f0;">syntax-case</span> x ()
      [(_ (k x ...) e1 ... e2)
       (for-all identifier? #'(k x ...))
       #'(with-syntax ([x (datum-&gt;syntax #'k 'x)] ...)
           e1 ... e2)]
      [_
       (syntax-violation 'with-implicit <span style="color: #8b2252;">"invalid syntax"</span> x)])))
</pre>
</div>

<p>
With it, we can rewrite our <code>loop</code> macro as follows:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">loop</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(k e ...)
       (<span style="color: #a020f0;">with-implicit</span> (k break)
         #'(<span style="color: #a020f0;">call-with-current-continuation</span>
            (<span style="color: #a020f0;">lambda</span> (break)
              (<span style="color: #a020f0;">let</span> <span style="color: #0000ff;">f</span> ()
                e ...
                (f)))))])))
</pre>
</div>
</div>
</div>
