README.html

<div id="outline-container-org2c645c6" class="outline-3">
<h3 id="org2c645c6"><span class="section-number-3">7.3.</span> Definitions that make the bound name accessible</h3>
<div class="outline-text-3" id="text-7-3">
<p>
For those who didn't like the <code>loop</code> example because it is mostly
useful in imperative programming, we have provided another example,
that we will describe in this subsection.
</p>

<p>
User-friendly procedures check their arguments so that errors are
reported early:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">reverse-append</span>
  (<span style="color: #a020f0;">lambda</span> (head tail)
    (<span style="color: #a020f0;">unless</span> (list? head)
      (assertion-violation 'reverse-append <span style="color: #8b2252;">"invalid list argument"</span> head))
    (<span style="color: #a020f0;">let</span> <span style="color: #0000ff;">f</span> ([head head] [tail tail])
      (<span style="color: #a020f0;">cond</span>
       [(null? head) tail]
       [(pair? head)
        (f (cdr head) (cons (car head) tail))]
       [<span style="color: #a020f0;">else</span>
        (assertion-violation 'reverse-append <span style="color: #8b2252;">"concurrent modification detected"</span>)]))))
</pre>
</div>

<p>
Just a brief test:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(reverse-append '(1 2 3) '(4 5 6))
</pre>
</div>

<pre class="example" id="orgd9538b3">
(3 2 1 4 5 6)
</pre>

<p>
The Scheme procedure that is used here to report an error is
<code>assertion-violation</code>.  Its first formal argument is called <code>who</code> and
(if not <code>#f</code>) should be a string or symbol naming the procedure where
the error occurs.
</p>

<p>
One can make the point that the code above again violates some
instance of the DRY principle because we had to type the name of the
procedure, <code>reverse-append</code> in this case, three times.  The following,
non-hygienic, macro, which can also be found in the source code of
Chez Scheme and in one of Racket's libraries, helps:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">define/who</span>
  (<span style="color: #a020f0;">lambda</span> (x)
    (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">out</span>
      (<span style="color: #a020f0;">lambda</span> (k f e)
        (with-syntax ([k k] [f f] [e e])
          (<span style="color: #a020f0;">with-implicit</span> (k who)
            #'(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">f</span>
                (<span style="color: #a020f0;">let</span> ((who 'f)) e))))))
    (<span style="color: #a020f0;">syntax-case</span> x ()
      [(k (f . u) e1 ... e2)
       (identifier? #'f)
       (out #'k #'f #'(<span style="color: #a020f0;">lambda</span> u e1 ... e2))]
      [(k f e)
       (identifier? #'f)
       (out #'k #'f #'e)]
      [_
       (syntax-violation 'define/who <span style="color: #8b2252;">"invalid syntax"</span> x)])))
</pre>
</div>

<p>
With <code>define/who</code> we can define a variable (or procedure) as with
<code>define</code>.  Moreover, the identifier <code>who</code> (with a lexical and historic
context as the keyword <code>define/who</code> in the macro use) is bound to the
name of the variable (or procedure) being defined.
</p>

<p>
With <code>define/who</code>, the definition of <code>reverse-append</code> looks like:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define/who reverse-append
  (<span style="color: #a020f0;">lambda</span> (head tail)
    (<span style="color: #a020f0;">unless</span> (list? head)
      (assertion-violation 'who <span style="color: #8b2252;">"invalid list argument"</span> head))
    (<span style="color: #a020f0;">let</span> <span style="color: #0000ff;">f</span> ([head head] [tail tail])
      (<span style="color: #a020f0;">cond</span>
       [(null? head) tail]
       [(pair? head)
        (f (cdr head) (cons (car head) tail))]
       [<span style="color: #a020f0;">else</span>
        (assertion-violation 'who <span style="color: #8b2252;">"concurrent modification detected"</span>)]))))
</pre>
</div>

<p>
We can compare <code>who</code> with the predefined identifier <code>__func__</code> that
can be found in the C99 standard.  With Scheme and its macro system,
however, this becomes a library feature and need not be a language
feature.
</p>
</div>
</div>
