README.org
** Definitions of constants

In Scheme, we can use ~define~ to, well, define a variable.  This
variable can be ~set!~ by other parts of the code, possibly
accidentally.  So we may want to define a variable-like object that
behaves more like a constant.  One option is to use the
~identifier-syntax~ form, we already saw at the beginning of the
tutorial:

#+BEGIN_SRC scheme :results value :exports both :wrap example
  (define-syntax pi (identifier-syntax 3.14159))
  pi
#+END_SRC

#+RESULTS:
#+begin_example
3.14159
#+end_example

If we tried to mutate the "variable" ~pi~ now, the Scheme system would
raise an exception.

This is a good point to give the actual definition of
~identifier-syntax~.  Like ~syntax-rules~, it can be defined by the
more primitive forms ~syntax-case~ and ~syntax~:

#+BEGIN_SRC scheme :eval no
  (define-syntax identifier-syntax
    (syntax-rules (set!)
      [(_ e)
       (lambda (x)
         (syntax-case x ()
           [id (identifier? #’id) #’e]
           [(_ x (... ...)) #’(e x (... ...))]))]
      [(_ (id exp1) ((set! var val) exp2))
       (and (identifier? #’id) (identifier? #’var))
       (make-variable-transformer
        (lambda (x)
          (syntax-case x (set!)
            [(set! var val) #’exp2]
            [(id x (... ...)) #’(exp1 x (... ...))]
            [id (identifier? #’id) #’exp1])))]))
#+END_SRC

This definition can be found exactly in this form in the R6RS,
describing the Scheme language and its standard libraries.  Again, we
see the occurrence of the quoted ellipses ~(... ...)~, which is
necessary because of the nesting of templates (remember that the right
hand side of ~syntax-rules~ rules are ~syntax~ templates).

We also note the two patterns within the first ~syntax-case~.  The
first pattern is of the form ~id~ where ~id~ is an identifier, the
second pattern is of the form ~(_ x ...)~ where ~x~ is an arbitrary
form.  The first pattern will match if the identifier, ~pi~ in our
example, is not used in head-position of a combination; the second
pattern will match if ~pi~ is used in the form ~(pi x ...)~.  The
latter does not make sense for ~pi~, but we see that
~identifier-syntax~ allows us to define procedure-like identifiers
that behave differently when the directly applied or when referenced.

In the second part of the definition of ~identifier-syntax~, the
procedure ~make-variable-transformer~ is used.  This turns a macro
transformer given by a procedure (mapping syntax objects to syntax
objects) into a /variable-transformer/.  A variable-transformer does
the same mapping between syntax objects but will also be called by the
expander when it processes an expression of the form ~(set! id form)~
where ~id~ is the keyword bound to a variable-transformer.

Now, 3.14159 is not the most precise value of ~pi~.  We get a value
whose precision is adapted to the precision of Schemes inexact real
numbers by using the formula ~(* 2 (atan 1 0))~.  This directly leads to the
following attempt of redefining ~pi~:

#+BEGIN_SRC scheme :results value :exports both :wrap example
  (define-syntax pi (identifier-syntax (* 2 (atan 1 0))))
  pi
#+END_SRC

#+RESULTS:
#+begin_example
3.141592653589793
#+end_example

This is not a good solution, though.  Every time, we reference ~pi~,
Scheme replaces it by the expression ~(* 2 (atan 1 0))~, so unless we
can rely on a sufficiently optimizing compiler, we will have ~pi~
recalculated every time we use it.  A better approach is to calculate
the value once, store this is a variable and expand into a reference
to it:

#+BEGIN_SRC scheme :results silent
  (define-syntax define-constant
    (lambda (stx)
      (syntax-case stx ()
        [(_ id expr)
         (identifier? #'id)
         #'(begin
             (define val expr)
             (define-syntax id (identifier-syntax val)))])))
#+END_SRC

Again, we have macro-defining macro.  Thanks to hygiene, the variable
~val~ cannot be accessed outside the macro.  Let's test our new macro:

#+BEGIN_SRC scheme :results value :exports both :wrap example
  (define-constant pi (* 2 (atan 1 0)))
  pi
#+END_SRC

#+RESULTS:
#+begin_example
3.141592653589793
#+end_example

The number ~pi~ is just a single constant, so let us now turn to a use
case where not only more than one constant but many constants are
needed.  For concreteness, let us assume that want to develop a
library handling ELF files.  We could start with defining all the
magic constants:

#+BEGIN_SRC scheme :eval no
  (define-constant et-none #x00)
  (define-constant et-rel  #x01)
  (define-constant et-exec #x02)
  ...
  (define-constant pt-null #x00000000)
  (define-constant pt-load #x00000001)
  ...
#+END_SRC

This is not much different from what we would do in C.  However, it
has the same problem.  It pollutes our top-level namespace.  In
Scheme, this is mitigated a bit due to the library system (which
allows one to confine these constants in a module); nevertheless a
library that exports myriads of identifiers (and where the exact set
of identifiers may depend on the version of the ELF format) is not a
good idea.

A way out is --- you will already have guessed it --- the Scheme macro
system.  We will implement a macro ~define-constants~ that can be used
as follows:

#+BEGIN_SRC scheme :eval no
  (define-constants elf-constant
    (et-none #x00)
    (et-rel  #x01)
    ...)

  (elf-constant et-none) ; => 0x01
#+END_SRC

Moreover, we want this definition to bind the identifier
~elf-constants~ (note the "s") to a procedure returning an association
list of the form

#+BEGIN_SRC scheme :eval no
  ((et-none . #x00)
   (et-rel  . #x01)
   ...)
#+END_SRC

For this, we first need a procedure that takes an identifier like
~elf-constant~ and constructs a new identifier, ~elf-constants~ in
this case, from it:

#+BEGIN_SRC scheme :results silent
  (define/who construct-name
    (lambda (k . arg*)
      (unless (identifier? k)
        (assertion-violation who "invalid template identifier argument" k))
      (datum->syntax
       k
       (string->symbol
        (apply string-append
               (map (lambda (x)
                      (cond
                       [(string? x)
                        x]
                       [(identifier? x)
                        (symbol->string (syntax->datum x))]
                       [else
                        (assertion-violation who "invalid string or identifier argument" x)]))
                    arg*))))))
#+END_SRC

This procedure takes a template identifier ~k~ and a sequence of
strings and identifiers to forge and return an identifier with the
same lexical and historic context as ~k~ and whose name is given by
the concatenation of the sequence of strings and identifier (names).

With it, we can define our ~define-constants~ easily:

#+BEGIN_SRC scheme :results silent
  (define-syntax define-constants
    (lambda (x)
      (syntax-case x ()
        [(_ t (n c) ...)
         (and (identifier? #'t)
              (for-all identifier? #'(n ...)))
         (with-syntax ([ts (construct-name #'t #'t "s")]
                       [(e ...) (generate-temporaries #'(c ...))])
           #'(begin
               (define e c)
               ...
               (define-syntax t
                 (lambda (x)
                   (syntax-case x ()
                     [(_ y)
                      (identifier? #'y)
                      (cond
                       [(assq (syntax->datum #'y) (list (cons 'n #'e) ...)) => cdr]
                       [else
                        (syntax-violation 't "unknown constant" x #'y)])]
                     [_
                      (syntax-violation 't "invalid syntax" x)])))
               (define ts
                 (lambda ()
                   '([n . c] ...)))))])))
#+END_SRC

The macro is programmed so that the lookup of the constant happens at
expand-time and not at run-time.  Let us test it:

#+BEGIN_SRC scheme :results value :exports both :wrap example
  (define-constants color
    (salmon          #xFA8072)
    (light-green     #x90EE90)
    (cornflower-blue #x6495ED))

  (colors)
#+END_SRC

#+RESULTS:
#+begin_example
((salmon . 16416882) (light-green . 9498256) (cornflower-blue . 6591981))
#+end_example

#+BEGIN_SRC scheme :results value :exports both :wrap example
  (color cornflower-blue)
#+END_SRC

#+RESULTS:
#+begin_example
6591981
#+end_example

