README.html

<div id="outline-container-org2425df9" class="outline-3">
<h3 id="org2425df9"><span class="section-number-3">7.4.</span> Definitions of constants</h3>
<div class="outline-text-3" id="text-7-4">
<p>
In Scheme, we can use <code>define</code> to, well, define a variable.  This
variable can be <code>set!</code> by other parts of the code, possibly
accidentally.  So we may want to define a variable-like object that
behaves more like a constant.  One option is to use the
<code>identifier-syntax</code> form, we already saw at the beginning of the
tutorial:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">pi</span> (identifier-syntax 3.14159))
pi
</pre>
</div>

<pre class="example" id="org828ffb5">
3.14159
</pre>

<p>
If we tried to mutate the "variable" <code>pi</code> now, the Scheme system would
raise an exception.
</p>

<p>
This is a good point to give the actual definition of
<code>identifier-syntax</code>.  Like <code>syntax-rules</code>, it can be defined by the
more primitive forms <code>syntax-case</code> and <code>syntax</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">identifier-syntax</span>
  (<span style="color: #a020f0;">syntax-rules</span> (<span style="color: #a020f0;">set!</span>)
    [(_ e)
     (<span style="color: #a020f0;">lambda</span> (x)
       (<span style="color: #a020f0;">syntax-case</span> x ()
         [id (identifier? #&#8217;id) #&#8217;e]
         [(_ x (... ...)) #&#8217;(e x (... ...))]))]
    [(_ (id exp1) ((<span style="color: #a020f0;">set!</span> var val) exp2))
     (<span style="color: #a020f0;">and</span> (identifier? #&#8217;id) (identifier? #&#8217;var))
     (make-variable-transformer
      (<span style="color: #a020f0;">lambda</span> (x)
        (<span style="color: #a020f0;">syntax-case</span> x (<span style="color: #a020f0;">set!</span>)
          [(<span style="color: #a020f0;">set!</span> var val) #&#8217;exp2]
          [(id x (... ...)) #&#8217;(exp1 x (... ...))]
          [id (identifier? #&#8217;id) #&#8217;exp1])))]))
</pre>
</div>

<p>
This definition can be found exactly in this form in the R6RS,
describing the Scheme language and its standard libraries.  Again, we
see the occurrence of the quoted ellipses <code>(... ...)</code>, which is
necessary because of the nesting of templates (remember that the right
hand side of <code>syntax-rules</code> rules are <code>syntax</code> templates).
</p>

<p>
We also note the two patterns within the first <code>syntax-case</code>.  The
first pattern is of the form <code>id</code> where <code>id</code> is an identifier, the
second pattern is of the form <code>(_ x ...)</code> where <code>x</code> is an arbitrary
form.  The first pattern will match if the identifier, <code>pi</code> in our
example, is not used in head-position of a combination; the second
pattern will match if <code>pi</code> is used in the form <code>(pi x ...)</code>.  The
latter does not make sense for <code>pi</code>, but we see that
<code>identifier-syntax</code> allows us to define procedure-like identifiers
that behave differently when the directly applied or when referenced.
</p>

<p>
In the second part of the definition of <code>identifier-syntax</code>, the
procedure <code>make-variable-transformer</code> is used.  This turns a macro
transformer given by a procedure (mapping syntax objects to syntax
objects) into a <i>variable-transformer</i>.  A variable-transformer does
the same mapping between syntax objects but will also be called by the
expander when it processes an expression of the form <code>(set! id form)</code>
where <code>id</code> is the keyword bound to a variable-transformer.
</p>

<p>
Now, 3.14159 is not the most precise value of <code>pi</code>.  We get a value
whose precision is adapted to the precision of Schemes inexact real
numbers by using the formula <code>(* 2 (atan 1 0))</code>.  This directly leads to the
following attempt of redefining <code>pi</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">pi</span> (identifier-syntax (* 2 (atan 1 0))))
pi
</pre>
</div>

<pre class="example" id="org5005e35">
3.141592653589793
</pre>

<p>
This is not a good solution, though.  Every time, we reference <code>pi</code>,
Scheme replaces it by the expression <code>(* 2 (atan 1 0))</code>, so unless we
can rely on a sufficiently optimizing compiler, we will have <code>pi</code>
recalculated every time we use it.  A better approach is to calculate
the value once, store this is a variable and expand into a reference
to it:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">define-constant</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(_ id expr)
       (identifier? #'id)
       #'(<span style="color: #a020f0;">begin</span>
           (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">val</span> expr)
           (<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">id</span> (identifier-syntax val)))])))
</pre>
</div>

<p>
Again, we have macro-defining macro.  Thanks to hygiene, the variable
<code>val</code> cannot be accessed outside the macro.  Let's test our new macro:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define-constant pi (* 2 (atan 1 0)))
pi
</pre>
</div>

<pre class="example" id="orgeaca1fa">
3.141592653589793
</pre>

<p>
The number <code>pi</code> is just a single constant, so let us now turn to a use
case where not only more than one constant but many constants are
needed.  For concreteness, let us assume that want to develop a
library handling ELF files.  We could start with defining all the
magic constants:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define-constant et-none #x00)
(define-constant et-rel  #x01)
(define-constant et-exec #x02)
...
(define-constant pt-null #x00000000)
(define-constant pt-load #x00000001)
...
</pre>
</div>

<p>
This is not much different from what we would do in C.  However, it
has the same problem.  It pollutes our top-level namespace.  In
Scheme, this is mitigated a bit due to the library system (which
allows one to confine these constants in a module); nevertheless a
library that exports myriads of identifiers (and where the exact set
of identifiers may depend on the version of the ELF format) is not a
good idea.
</p>

<p>
A way out is &#x2014; you will already have guessed it &#x2014; the Scheme macro
system.  We will implement a macro <code>define-constants</code> that can be used
as follows:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define-constants elf-constant
  (et-none #x00)
  (et-rel  #x01)
  ...)

(elf-constant et-none) <span style="color: #b22222;">; </span><span style="color: #b22222;">=&gt; 0x01</span>
</pre>
</div>

<p>
Moreover, we want this definition to bind the identifier
<code>elf-constants</code> (note the "s") to a procedure returning an association
list of the form
</p>

<div class="org-src-container">
<pre class="src src-scheme">((et-none . #x00)
 (et-rel  . #x01)
 ...)
</pre>
</div>

<p>
For this, we first need a procedure that takes an identifier like
<code>elf-constant</code> and constructs a new identifier, <code>elf-constants</code> in
this case, from it:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define/who construct-name
  (<span style="color: #a020f0;">lambda</span> (k . arg*)
    (<span style="color: #a020f0;">unless</span> (identifier? k)
      (assertion-violation who <span style="color: #8b2252;">"invalid template identifier argument"</span> k))
    (datum-&gt;syntax
     k
     (string-&gt;symbol
      (apply string-append
             (<span style="color: #a020f0;">map</span> (<span style="color: #a020f0;">lambda</span> (x)
                    (<span style="color: #a020f0;">cond</span>
                     [(string? x)
                      x]
                     [(identifier? x)
                      (symbol-&gt;string (syntax-&gt;datum x))]
                     [<span style="color: #a020f0;">else</span>
                      (assertion-violation who <span style="color: #8b2252;">"invalid string or identifier argument"</span> x)]))
                  arg*))))))
</pre>
</div>

<p>
This procedure takes a template identifier <code>k</code> and a sequence of
strings and identifiers to forge and return an identifier with the
same lexical and historic context as <code>k</code> and whose name is given by
the concatenation of the sequence of strings and identifier (names).
</p>

<p>
With it, we can define our <code>define-constants</code> easily:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">define-constants</span>
  (<span style="color: #a020f0;">lambda</span> (x)
    (<span style="color: #a020f0;">syntax-case</span> x ()
      [(_ t (n c) ...)
       (<span style="color: #a020f0;">and</span> (identifier? #'t)
            (for-all identifier? #'(n ...)))
       (with-syntax ([ts (construct-name #'t #'t <span style="color: #8b2252;">"s"</span>)]
                     [(e ...) (generate-temporaries #'(c ...))])
         #'(<span style="color: #a020f0;">begin</span>
             (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">e</span> c)
             ...
             (<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">t</span>
               (<span style="color: #a020f0;">lambda</span> (x)
                 (<span style="color: #a020f0;">syntax-case</span> x ()
                   [(_ y)
                    (identifier? #'y)
                    (<span style="color: #a020f0;">cond</span>
                     [(assq (syntax-&gt;datum #'y) (list (cons 'n #'e) ...)) =&gt; cdr]
                     [<span style="color: #a020f0;">else</span>
                      (syntax-violation 't <span style="color: #8b2252;">"unknown constant"</span> x #'y)])]
                   [_
                    (syntax-violation 't <span style="color: #8b2252;">"invalid syntax"</span> x)])))
             (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">ts</span>
               (<span style="color: #a020f0;">lambda</span> ()
                 '([n . c] ...)))))])))
</pre>
</div>

<p>
The macro is programmed so that the lookup of the constant happens at
expand-time and not at run-time.  Let us test it:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define-constants color
  (salmon          #xFA8072)
  (light-green     #x90EE90)
  (cornflower-blue #x6495ED))

(colors)
</pre>
</div>

<pre class="example" id="org7a9e60b">
((salmon . 16416882) (light-green . 9498256) (cornflower-blue . 6591981))
</pre>

<div class="org-src-container">
<pre class="src src-scheme">(color cornflower-blue)
</pre>
</div>

<pre class="example" id="org921d2b2">
6591981
</pre>
</div>
</div>
