README.org
** A pitfall

Although the macros ~loop~ and ~define/who~ defined above are
non-hygienic, they are only so in a controlled sense.  They behave as
if the user has provided an explicit ~break~ or ~who~ identifier, so
do not really differ from a hygienic macro, which makes reasoning
about them still easy.

Nevertheless, there is still a potential pitfall, we are going to
explain now.  Consider the following definition of the macro
~define-logging/who~:

#+BEGIN_SRC scheme :results silent
  (define-syntax define-logging/who
    (syntax-rules ()
      [(define-logging/who (name . formals) body1 ... body2)
       (define/who (name . formals)
         (display "log: entering procedure ")
         (display who)
         (newline)
         body1 ... body2)]))
#+END_SRC

The macro defines a "logging procedure", a procedure that prints a log
message when it is called:

#+BEGIN_SRC scheme :results output :exports both :wrap example
  (define-logging/who (hello)
    (display "Hello!\n"))
  (hello)
#+END_SRC

#+RESULTS:
#+begin_example
log: entering procedure hello
Hello!
#+end_example

The ~define-logging/who~ macro's output is an instance of the
~define/who~ macro from earlier.  The ~define-logging/who~ macro makes
use of the implicitly defined ~who~ identifier.

We named the macro ~define-logging/who~ with the suffix ~/who~ because
the idea is that the user of the ~define-logging/who~ macro can also
refer to the procedure's name through the implicitly bound identifier
~who~.  This, however, is not the case as the following test shows:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (let ([who 'outer])
    (define-logging/who (return-who)
      who)
    (return-who))
#+END_SRC

#+RESULTS:
#+begin_example
outer
#+end_example

The reason is that historic context of the identifier ~who~ is the
same as the historic context of the identifier ~define/who~ that
occurs in the syntax template in the definition of
~define-logging/who~.  The historic context of the identifier
~define/who~, which does not come from the macro input in the use of
~define-logging/who~, is therefore not the same as those of the
identifiers ~who~ appearing in the source of our test.

This problem cannot be easily mitigated bar explicitly define ~who~ a
second time with the historic context of the final macro use.  One
could think a possible solution would be the following rewrite:

#+BEGIN_SRC scheme :results silent
  (define-syntax define-logging/who
    (lambda (stx)
      (syntax-case stx ()
        [(k (name . formals) body1 ... body2)
         (with-implicit (k define/who who)
           #'(define/who (name . formals)
               (display "log: entering procedure ")
               (display who)
               (newline)
               body1 ... body2))])))
#+END_SRC

Here, the identifier ~define/who~ is put in the macro output of
~define-logging/who~ with the same history as the keyword in the macro
use of ~define-logging/who~.  This will create ~who~ with the historic
context of the macro use of ~define-logging/who~ (and that's why we
had to add ~who~ to the list of implicit identifiers as well), but it
will only work if ~define/who~ is also bound (to the correct macro) at
the use site of the macro ~define-logging/who~.  Such an assumption,
however, should not be made.  (In the section after next we are going
to finally give a solution that works, but it needs an extension which
is not in R6RS.)

Our other example for a macro with implicit (unhygienic) identifiers
was ~define-constant~ where the plural form of the name of the defined
macro was a forged identifier.  That identifier's history, however,
was not derived from the macro keyword in the macro use but from the
(singular) name of the defined macro.  This also helps mitigating the
problem of nested macro invocations described above.

* Phasing

Phasing is an issue that is not specific to the particular macro
system of Scheme or hygienic macros but occurs with procedural macros
when the system distinguishes between run-time and expand-time.  The
latter distinction is important, for example, for the possibility of
ahead-of-time compilation.  As Scheme allows to evaluate code at run
time, which then has to be expanded first, run-time and expand-time
can be interleaved.  The latter can also be due to the library system
of Scheme; a library may need to be run first before another library
can be expanded because the macro transformers may reference the code
of the first library.

** (Relative) phases

When the expressions in a program or library are evaluated, the
evaluation happens at a specific /relative phase/.  These relative
phases are non-negative integers.  The top-level expressions are
evaluated at relative phase 0.  The right-hand sides of top-level
variable definitions are also evaluated at relative phase 0.  The
right-hand sides of top-level syntax definitions are evaluated at
relative phase 1 (which means: "earlier").  The right-hand side of a
variable definition appearing within an expression evaluated at
relative phase /n/ is also evaluated at relative phase /n/.  The
right-hand side of a syntax definition appearing within an expression
evaluated at relative phase /n/ is evaluated at relative /n/ + 1.

In other words, /define-syntax/ shifts the phase by one for its
right-hand side.

The following code should make this clearer:

#+BEGIN_SRC scheme :eval no
  (begin
    (define x 4)
    (define-syntax foo
      (lambda (stx)
        (define-syntax bar
          (lambda (stx)
            #'3))
        (+ 1 bar)))
    (+ x foo))
#+END_SRC

Assume that this expression is evaluated at phase /n/ (0 if appearing
at the program top-level).  The right-hand side of the definition of
~x~, the reference to ~x~ and the use of the macro ~foo~ are evaluated
at relative phase /n/.  The transformer expression of ~foo~ is
evaluated at relative phases /n/ + 1, and the transformer expression
of ~bar~ is evaluated at relative phase /n/ + 2.

