README.html

<div id="outline-container-org000b7fa" class="outline-3">
<h3 id="org000b7fa"><span class="section-number-3">7.5.</span> A pitfall</h3>
<div class="outline-text-3" id="text-7-5">
<p>
Although the macros <code>loop</code> and <code>define/who</code> defined above are
non-hygienic, they are only so in a controlled sense.  They behave as
if the user has provided an explicit <code>break</code> or <code>who</code> identifier, so
do not really differ from a hygienic macro, which makes reasoning
about them still easy.
</p>

<p>
Nevertheless, there is still a potential pitfall, we are going to
explain now.  Consider the following definition of the macro
<code>define-logging/who</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">define-logging/who</span>
  (<span style="color: #a020f0;">syntax-rules</span> ()
    [(define-logging/who (name . formals) body1 ... body2)
     (define/who (name . formals)
       (display <span style="color: #8b2252;">"log: entering procedure "</span>)
       (display who)
       (newline)
       body1 ... body2)]))
</pre>
</div>

<p>
The macro defines a "logging procedure", a procedure that prints a log
message when it is called:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define-logging/who (hello)
  (display <span style="color: #8b2252;">"Hello!\n"</span>))
(hello)
</pre>
</div>

<pre class="example" id="org193bee2">
log: entering procedure hello
Hello!
</pre>

<p>
The <code>define-logging/who</code> macro's output is an instance of the
<code>define/who</code> macro from earlier.  The <code>define-logging/who</code> macro makes
use of the implicitly defined <code>who</code> identifier.
</p>

<p>
We named the macro <code>define-logging/who</code> with the suffix <code>/who</code> because
the idea is that the user of the <code>define-logging/who</code> macro can also
refer to the procedure's name through the implicitly bound identifier
<code>who</code>.  This, however, is not the case as the following test shows:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([who 'outer])
  (define-logging/who (return-who)
    who)
  (return-who))
</pre>
</div>

<pre class="example" id="orgd3a8042">
outer
</pre>

<p>
The reason is that historic context of the identifier <code>who</code> is the
same as the historic context of the identifier <code>define/who</code> that
occurs in the syntax template in the definition of
<code>define-logging/who</code>.  The historic context of the identifier
<code>define/who</code>, which does not come from the macro input in the use of
<code>define-logging/who</code>, is therefore not the same as those of the
identifiers <code>who</code> appearing in the source of our test.
</p>

<p>
This problem cannot be easily mitigated bar explicitly define <code>who</code> a
second time with the historic context of the final macro use.  One
could think a possible solution would be the following rewrite:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">define-logging/who</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(k (name . formals) body1 ... body2)
       (<span style="color: #a020f0;">with-implicit</span> (k define/who who)
         #'(define/who (name . formals)
             (display <span style="color: #8b2252;">"log: entering procedure "</span>)
             (display who)
             (newline)
             body1 ... body2))])))
</pre>
</div>

<p>
Here, the identifier <code>define/who</code> is put in the macro output of
<code>define-logging/who</code> with the same history as the keyword in the macro
use of <code>define-logging/who</code>.  This will create <code>who</code> with the historic
context of the macro use of <code>define-logging/who</code> (and that's why we
had to add <code>who</code> to the list of implicit identifiers as well), but it
will only work if <code>define/who</code> is also bound (to the correct macro) at
the use site of the macro <code>define-logging/who</code>.  Such an assumption,
however, should not be made.  (In the section after next we are going
to finally give a solution that works, but it needs an extension which
is not in R6RS.)
</p>

<p>
Our other example for a macro with implicit (unhygienic) identifiers
was <code>define-constant</code> where the plural form of the name of the defined
macro was a forged identifier.  That identifier's history, however,
was not derived from the macro keyword in the macro use but from the
(singular) name of the defined macro.  This also helps mitigating the
problem of nested macro invocations described above.
</p>
</div>
</div>
</div>

<div id="outline-container-org85581d7" class="outline-2">
<h2 id="org85581d7"><span class="section-number-2">8.</span> Phasing</h2>
<div class="outline-text-2" id="text-8">
<p>
Phasing is an issue that is not specific to the particular macro
system of Scheme or hygienic macros but occurs with procedural macros
when the system distinguishes between run-time and expand-time.  The
latter distinction is important, for example, for the possibility of
ahead-of-time compilation.  As Scheme allows to evaluate code at run
time, which then has to be expanded first, run-time and expand-time
can be interleaved.  The latter can also be due to the library system
of Scheme; a library may need to be run first before another library
can be expanded because the macro transformers may reference the code
of the first library.
</p>
</div>

<div id="outline-container-org4f580b4" class="outline-3">
<h3 id="org4f580b4"><span class="section-number-3">8.1.</span> (Relative) phases</h3>
<div class="outline-text-3" id="text-8-1">
<p>
When the expressions in a program or library are evaluated, the
evaluation happens at a specific <i>relative phase</i>.  These relative
phases are non-negative integers.  The top-level expressions are
evaluated at relative phase 0.  The right-hand sides of top-level
variable definitions are also evaluated at relative phase 0.  The
right-hand sides of top-level syntax definitions are evaluated at
relative phase 1 (which means: "earlier").  The right-hand side of a
variable definition appearing within an expression evaluated at
relative phase <i>n</i> is also evaluated at relative phase <i>n</i>.  The
right-hand side of a syntax definition appearing within an expression
evaluated at relative phase <i>n</i> is evaluated at relative <i>n</i> + 1.
</p>

<p>
In other words, <i>define-syntax</i> shifts the phase by one for its
right-hand side.
</p>

<p>
The following code should make this clearer:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">begin</span>
  (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> 4)
  (<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">foo</span>
    (<span style="color: #a020f0;">lambda</span> (stx)
      (<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">bar</span>
        (<span style="color: #a020f0;">lambda</span> (stx)
          #'3))
      (+ 1 bar)))
  (+ x foo))
</pre>
</div>

<p>
Assume that this expression is evaluated at phase <i>n</i> (0 if appearing
at the program top-level).  The right-hand side of the definition of
<code>x</code>, the reference to <code>x</code> and the use of the macro <code>foo</code> are evaluated
at relative phase <i>n</i>.  The transformer expression of <code>foo</code> is
evaluated at relative phases <i>n</i> + 1, and the transformer expression
of <code>bar</code> is evaluated at relative phase <i>n</i> + 2.
</p>
</div>
</div>
