README.org
** Identifier references at different phases

A variable (an identifier bound to a location holding a value) can be
referenced by an expression if the expression is evaluated at the same
relative phase as the initializing expression of the variable.  A
keyword (an identifier bound to a macro transformer) can be referenced
by an expression if the expression is evaluated at the same or higher
relative phase than the phase of the transformer expression of the
keyword minus one.

The following code is erroneous, for example:

#+BEGIN_SRC scheme :eval no
  (let ([counter 0])
    (define-syntax count!
      (lambda (stx)
        (syntax-case stx ()
          [(_)
           (begin
             (set! counter (+ 1 counter))
             #'(values))])))
    (count!)
    counter)
#+END_SRC

The variable ~counter~ can only be referenced at relative phase 0,
thus not in the right-hand side of the syntax definition of ~count!~,
which is evaluated at relative phase 1.  One can understand this
restriction as follows: The variable ~counter~ only exists at
run-time, not at compile-time of the program, but the transformer
associated to ~count!~ us used at compile-time.

On the other hand, the following example is correct code:

#+BEGIN_SRC scheme :results value :export both :wrap example
  (let-syntax ([foo (lambda (stx) #'1)])
    (define-syntax bar
      (lambda (stx)
        (define-syntax quux
          (lambda (stx)
            foo))
        quux))
    bar)
#+END_SRC

#+RESULTS:
#+begin_example
1
#+end_example

If a procedure needs to be used in different phases, in Scheme the
library system can be used.  If a library exports a variable (bound to
the procedure) or any other identifier, the identifier can be imported
at any relative phase.

* Extensions

In this section, we will describe three extensions to Scheme macro's
system that are not yet standardized in one the reports.  All three
extensions are supported by Chez Scheme, so we can experiment with
them.

** Aliases

Given an identifier ~x~, we may want to use it under a different name
as well.  The first attempt of defining an alias for ~x~ may look
like:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (let ([x 'old])
    (define-syntax y
      (identifier-syntax
       [_ x]
       [(set! _ e) (set! x e)]))
    (set! y 'new)
    x)
#+END_SRC

#+RESULTS:
#+begin_example
new
#+end_example

This solution has no run-time overhead because ~y~ is a keyword and
not a variable.  Whenever we access ~y~, Scheme's expander rewrites it
into an access of ~x~.  In a lot of cases, this is all that we need.
Still, ~y~ is not a true alias to ~x~.  This is demonstrated by the
following test:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (let ([x 'old])
    (define-syntax y
      (identifier-syntax
       [_ x]
       [(set! _ e) (set! x e)]))
    (free-identifier=? #'x #'y))
#+END_SRC

#+RESULTS:
#+begin_example
#f
#+end_example

The reason that the result of the ~free-identifier=?~ test is ~#f~ is
that ~x~ and ~y~ are bound differently.  The identifier ~x~ is bound
to a location holding a value (~x~ is a variable); the identifier ~y~
is bound to a macro transformer (~y~ is a keyword).

The ~alias~ form described in [[https://srfi.schemers.org/srfi-212/srfi-212.html][SRFI 212]] allows to define true aliases.
The syntax is ~(alias y x)~, which can be used wherever definitions
are allowed.  It arranges that ~y~ has the same binding as ~x~:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (let ([x 'old])
    (alias y x)
    (set! y 'new)
    (list (free-identifier=? #'x #'y) x))
#+END_SRC

#+RESULTS:
#+begin_example
(#t new)
#+end_example

(The reason why ~alias~ is not called ~define-alias~ is that it does
not define a new binding; it just gives an existing binding (the one
of ~x~) a new name (~y~).)

With the ~alias~ form, there is also a general solution to the general
problem of nested unhygienic macros that we exhibited with
~define-logging/who~:

#+BEGIN_SRC scheme :results silent
  (define-syntax define-logging/who
    (lambda (stx)
      (syntax-case stx ()
        [(k (name . formals) body1 ... body2)
         (with-syntax ([(tmp-id) (generate-temporaries #'(tmp))])
           (with-syntax ([local-define/who
                          (construct-name #'k #'tmp-id)])
             (with-implicit (k who)
               #'(begin
                   (alias local-define/who define/who)
                   (local-define/who (name . formals)
                     (display "log: entering procedure ")
                     (display who)
                     (newline)
                     body1 ... body2)))))])))
#+END_SRC

Here, we generate a fresh identifier and construct from its name an
identifier with the context of the keyword of the use of
~define-logging/who~.  This identifier is then aliased to ~define/who~
but is used instead so that the transformer bound to ~define/who~ (and
now also bound to ~define-logging/who~ forges the ~who~ identifier
with the right context.

Let us test our new version:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (let ([who 'outer])
    (define-logging/who (return-who)
      who)
    (return-who))
#+END_SRC

#+RESULTS:
#+begin_example
return-who
#+end_example

