README.html

<div id="outline-container-orgb7a52eb" class="outline-3">
<h3 id="orgb7a52eb"><span class="section-number-3">8.2.</span> Identifier references at different phases</h3>
<div class="outline-text-3" id="text-8-2">
<p>
A variable (an identifier bound to a location holding a value) can be
referenced by an expression if the expression is evaluated at the same
relative phase as the initializing expression of the variable.  A
keyword (an identifier bound to a macro transformer) can be referenced
by an expression if the expression is evaluated at the same or higher
relative phase than the phase of the transformer expression of the
keyword minus one.
</p>

<p>
The following code is erroneous, for example:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([counter 0])
  (<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">count!</span>
    (<span style="color: #a020f0;">lambda</span> (stx)
      (<span style="color: #a020f0;">syntax-case</span> stx ()
        [(_)
         (<span style="color: #a020f0;">begin</span>
           (<span style="color: #a020f0;">set!</span> counter (+ 1 counter))
           #'(values))])))
  (count!)
  counter)
</pre>
</div>

<p>
The variable <code>counter</code> can only be referenced at relative phase 0,
thus not in the right-hand side of the syntax definition of <code>count!</code>,
which is evaluated at relative phase 1.  One can understand this
restriction as follows: The variable <code>counter</code> only exists at
run-time, not at compile-time of the program, but the transformer
associated to <code>count!</code> us used at compile-time.
</p>

<p>
On the other hand, the following example is correct code:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let-syntax</span> ([foo (<span style="color: #a020f0;">lambda</span> (stx) #'1)])
  (<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">bar</span>
    (<span style="color: #a020f0;">lambda</span> (stx)
      (<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">quux</span>
        (<span style="color: #a020f0;">lambda</span> (stx)
          foo))
      quux))
  bar)
</pre>
</div>

<p>
If a procedure needs to be used in different phases, in Scheme the
library system can be used.  If a library exports a variable (bound to
the procedure) or any other identifier, the identifier can be imported
at any relative phase.
</p>
</div>
</div>
</div>

<div id="outline-container-org9d48857" class="outline-2">
<h2 id="org9d48857"><span class="section-number-2">9.</span> Extensions</h2>
<div class="outline-text-2" id="text-9">
<p>
In this section, we will describe three extensions to Scheme macro's
system that are not yet standardized in one the reports.  All three
extensions are supported by Chez Scheme, so we can experiment with
them.
</p>
</div>

<div id="outline-container-org0fd5875" class="outline-3">
<h3 id="org0fd5875"><span class="section-number-3">9.1.</span> Aliases</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Given an identifier <code>x</code>, we may want to use it under a different name
as well.  The first attempt of defining an alias for <code>x</code> may look
like:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([x 'old])
  (<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">y</span>
    (identifier-syntax
     [_ x]
     [(<span style="color: #a020f0;">set!</span> _ e) (<span style="color: #a020f0;">set!</span> x e)]))
  (<span style="color: #a020f0;">set!</span> y 'new)
  x)
</pre>
</div>

<pre class="example" id="orgce72631">
new
</pre>

<p>
This solution has no run-time overhead because <code>y</code> is a keyword and
not a variable.  Whenever we access <code>y</code>, Scheme's expander rewrites it
into an access of <code>x</code>.  In a lot of cases, this is all that we need.
Still, <code>y</code> is not a true alias to <code>x</code>.  This is demonstrated by the
following test:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([x 'old])
  (<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">y</span>
    (identifier-syntax
     [_ x]
     [(<span style="color: #a020f0;">set!</span> _ e) (<span style="color: #a020f0;">set!</span> x e)]))
  (free-identifier=? #'x #'y))
</pre>
</div>

<pre class="example" id="org15fb67f">
#f
</pre>

<p>
The reason that the result of the <code>free-identifier=?</code> test is <code>#f</code> is
that <code>x</code> and <code>y</code> are bound differently.  The identifier <code>x</code> is bound
to a location holding a value (<code>x</code> is a variable); the identifier <code>y</code>
is bound to a macro transformer (<code>y</code> is a keyword).
</p>

<p>
The <code>alias</code> form described in <a href="https://srfi.schemers.org/srfi-212/srfi-212.html">SRFI 212</a> allows to define true aliases.
The syntax is <code>(alias y x)</code>, which can be used wherever definitions
are allowed.  It arranges that <code>y</code> has the same binding as <code>x</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([x 'old])
  (alias y x)
  (<span style="color: #a020f0;">set!</span> y 'new)
  (list (free-identifier=? #'x #'y) x))
</pre>
</div>

<pre class="example" id="orgccb3668">
(#t new)
</pre>

<p>
(The reason why <code>alias</code> is not called <code>define-alias</code> is that it does
not define a new binding; it just gives an existing binding (the one
of <code>x</code>) a new name (<code>y</code>).)
</p>

<p>
With the <code>alias</code> form, there is also a general solution to the general
problem of nested unhygienic macros that we exhibited with
<code>define-logging/who</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">define-logging/who</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(k (name . formals) body1 ... body2)
       (with-syntax ([(tmp-id) (generate-temporaries #'(tmp))])
         (with-syntax ([local-define/who
                        (construct-name #'k #'tmp-id)])
           (<span style="color: #a020f0;">with-implicit</span> (k who)
             #'(<span style="color: #a020f0;">begin</span>
                 (alias local-define/who define/who)
                 (local-define/who (name . formals)
                   (display <span style="color: #8b2252;">"log: entering procedure "</span>)
                   (display who)
                   (newline)
                   body1 ... body2)))))])))
</pre>
</div>

<p>
Here, we generate a fresh identifier and construct from its name an
identifier with the context of the keyword of the use of
<code>define-logging/who</code>.  This identifier is then aliased to <code>define/who</code>
but is used instead so that the transformer bound to <code>define/who</code> (and
now also bound to <code>define-logging/who</code> forges the <code>who</code> identifier
with the right context.
</p>

<p>
Let us test our new version:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([who 'outer])
  (define-logging/who (return-who)
    who)
  (return-who))
</pre>
</div>

<pre class="example" id="org5243f80">
return-who
</pre>
</div>
</div>
