README.org
** Syntax parameters

Syntax parameters, which are like aliases also described in a SRFI,
namely [[https://srfi.schemers.org/srfi-139/srfi-139.html][SRFI 139]], provide an alternative to unhygienic macros when
implicit macro parameters are needed.[fn:11]

In what follows, we use Chez
Scheme's implementation so that we can readily test our examples.

Chez Scheme defines the ~fluid-let-syntax~ form, whose syntax is
equivalent to ~let-syntax~, but which is to ~let-syntax~ as
~fluid-let~ is to ~let~.  In other words, it rebinds a keyword for the
dynamic extent of the expansion of the body of ~fluid-let-syntax~:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (let-syntax ([x (identifier-syntax 'outer)])
    (define-syntax y (identifier-syntax x))
    (list
     (fluid-let-syntax ([x (identifier-syntax 'inner)])
       y)
     y))
#+END_SRC

#+RESULTS:
#+begin_example
(inner outer)
#+end_example

Compare this to ~let-syntax~:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (let-syntax ([x (identifier-syntax 'outer)])
    (define-syntax y (identifier-syntax x))
    (list
     (let-syntax ([x (identifier-syntax 'inner)])
       y)
     y))
#+END_SRC

#+RESULTS:
#+begin_example
(outer outer)
#+end_example

With the use of syntax parameters (keywords that are rebound by
~fluid-let-syntax~), we can give a definition of our ~loop~ macro as a
hygienic macro:

#+BEGIN_SRC scheme :results silent
  (define-syntax break
    (lambda (stx)
      (syntax-violation 'break "invalid use outside of loop form" stx)))
  (define-syntax loop
    (syntax-rules ()
      [(loop e ...)
       (call/cc
        (lambda (k)
          (fluid-let-syntax
              ([break (syntax-rules () [(break) (k)])])
            (let f ()
              e ... (f)))))]))
#+END_SRC

Let us test this new version:

#+BEGIN_SRC scheme :results output :exports both :wrap example
  (let ([i 0])
    (loop
      (when (= i 5)
        (break))
      (display i)
      (newline)
      (incr! i)))
#+END_SRC

#+RESULTS:
#+begin_example
0
1
2
3
4
#+end_example

In this example, ~datum->syntax~ does not appear so the macro defined
above is indeed hygienic.  The identifier ~break~ was not newly
introduced by the macro use but already existed in the lexical context
of the macro use.

It should be noted that the new ~loop~ macro has a different semantics
than the unhygienic ~loop~ macro from earlier.  In our original ~loop~
macro, the expression ~(break)~ ends the loop when ~break~ is
"~bound-identifier=?~" to the implicit identifier forged by the first
version of the ~loop~ macro.  In the version with syntax parameters,
the expression ~(break)~ ends the loop when ~break~ is
"~free-identifier=?~" to the global identifier named ~break~.  Which
semantics is the better one depends on the use case.  On the one hand
side, hygienic macros are preferable to unhygienic ones.  On the other
hand side, syntax parameters have the same problem associated to
variables with dynamic scope: Their change of the behavior of code is
not lexically confined.

The [[https://cisco.github.io/ChezScheme/csug9.5/syntax.html#./syntax:h1][Chez Scheme User's Guide]] contains a very interesting use of syntax
parameters, which we want to reproduce here:

#+BEGIN_SRC scheme :results silent
(define-syntax define-integrable
  (syntax-rules (lambda)
    [(_ name (lambda formals form1 form2 ...))
     (begin
       (define xname
         (fluid-let-syntax ([name (identifier-syntax xname)])
           (lambda formals form1 form2 ...)))
       (define-syntax name
         (lambda (x)
           (syntax-case x ()
             [_ (identifier? x) #'xname]
             [(_ arg (... ...))
              #'((fluid-let-syntax ([name (identifier-syntax xname)])
                   (lambda formals form1 form2 ...))
                  arg
                  (... ...))]))))]))
#+END_SRC

The ~define-integrable~ keyword can be used as follows:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (define-integrable count
    (lambda (ls)
      (if (null? ls)
          0
          (+ (car ls) (count (cdr ls))))))

  (list (count '(1 2 3))
        (procedure? count))
#+END_SRC

#+RESULTS:
#+begin_example
(6 #t)
#+end_example

This definition binds ~count~ to a keyword that behaves like an
immutable variable bound to a procedure.  However, when ~count~ is
used in the form ~(count '(1 2 3))~ the procedures body is inlined at
the macro use site, allowing for more local optimizations.  We chose
the example of a recursive procedure because it demonstrates a
difficulty: If ~count~ in the procedure's body were also inlined and
so on, we would get an infinite macro expansion.  Instead, the
implementation of ~define-integrable~ uses a syntax parameter to
rebound ~count~ in the procedure body so that it is not further
inlined.

