README.html

<div id="outline-container-orgcfe517e" class="outline-3">
<h3 id="orgcfe517e"><span class="section-number-3">9.2.</span> Syntax parameters</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Syntax parameters, which are like aliases also described in a SRFI,
namely <a href="https://srfi.schemers.org/srfi-139/srfi-139.html">SRFI 139</a>, provide an alternative to unhygienic macros when
implicit macro parameters are needed.<sup><a id="fnr.11" class="footref" href="#fn.11" role="doc-backlink">11</a></sup>
</p>

<p>
In what follows, we use Chez
Scheme's implementation so that we can readily test our examples.
</p>

<p>
Chez Scheme defines the <code>fluid-let-syntax</code> form, whose syntax is
equivalent to <code>let-syntax</code>, but which is to <code>let-syntax</code> as
<code>fluid-let</code> is to <code>let</code>.  In other words, it rebinds a keyword for the
dynamic extent of the expansion of the body of <code>fluid-let-syntax</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let-syntax</span> ([x (identifier-syntax 'outer)])
  (<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">y</span> (identifier-syntax x))
  (list
   (<span style="color: #a020f0;">fluid-let-syntax</span> ([x (identifier-syntax 'inner)])
     y)
   y))
</pre>
</div>

<pre class="example" id="orgd070ada">
(inner outer)
</pre>

<p>
Compare this to <code>let-syntax</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let-syntax</span> ([x (identifier-syntax 'outer)])
  (<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">y</span> (identifier-syntax x))
  (list
   (<span style="color: #a020f0;">let-syntax</span> ([x (identifier-syntax 'inner)])
     y)
   y))
</pre>
</div>

<pre class="example" id="orgb6a6c27">
(outer outer)
</pre>

<p>
With the use of syntax parameters (keywords that are rebound by
<code>fluid-let-syntax</code>), we can give a definition of our <code>loop</code> macro as a
hygienic macro:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">break</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (syntax-violation 'break <span style="color: #8b2252;">"invalid use outside of loop form"</span> stx)))
(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">loop</span>
  (<span style="color: #a020f0;">syntax-rules</span> ()
    [(loop e ...)
     (<span style="color: #a020f0;">call/cc</span>
      (<span style="color: #a020f0;">lambda</span> (k)
        (<span style="color: #a020f0;">fluid-let-syntax</span>
            ([break (<span style="color: #a020f0;">syntax-rules</span> () [(break) (k)])])
          (<span style="color: #a020f0;">let</span> <span style="color: #0000ff;">f</span> ()
            e ... (f)))))]))
</pre>
</div>

<p>
Let us test this new version:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let</span> ([i 0])
  (loop
    (<span style="color: #a020f0;">when</span> (= i 5)
      (break))
    (display i)
    (newline)
    (incr! i)))
</pre>
</div>

<pre class="example" id="orgb3f4c8a">
0
1
2
3
4
</pre>

<p>
In this example, <code>datum-&gt;syntax</code> does not appear so the macro defined
above is indeed hygienic.  The identifier <code>break</code> was not newly
introduced by the macro use but already existed in the lexical context
of the macro use.
</p>

<p>
It should be noted that the new <code>loop</code> macro has a different semantics
than the unhygienic <code>loop</code> macro from earlier.  In our original <code>loop</code>
macro, the expression <code>(break)</code> ends the loop when <code>break</code> is
"<code>bound-identifier=?</code>" to the implicit identifier forged by the first
version of the <code>loop</code> macro.  In the version with syntax parameters,
the expression <code>(break)</code> ends the loop when <code>break</code> is
"<code>free-identifier=?</code>" to the global identifier named <code>break</code>.  Which
semantics is the better one depends on the use case.  On the one hand
side, hygienic macros are preferable to unhygienic ones.  On the other
hand side, syntax parameters have the same problem associated to
variables with dynamic scope: Their change of the behavior of code is
not lexically confined.
</p>

<p>
The <a href="https://cisco.github.io/ChezScheme/csug9.5/syntax.html#./syntax:h1">Chez Scheme User's Guide</a> contains a very interesting use of syntax
parameters, which we want to reproduce here:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">define-integrable</span>
  (<span style="color: #a020f0;">syntax-rules</span> (<span style="color: #a020f0;">lambda</span>)
    [(_ name (<span style="color: #a020f0;">lambda</span> formals form1 form2 ...))
     (<span style="color: #a020f0;">begin</span>
       (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">xname</span>
         (<span style="color: #a020f0;">fluid-let-syntax</span> ([name (identifier-syntax xname)])
           (<span style="color: #a020f0;">lambda</span> formals form1 form2 ...)))
       (<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">name</span>
         (<span style="color: #a020f0;">lambda</span> (x)
           (<span style="color: #a020f0;">syntax-case</span> x ()
             [_ (identifier? x) #'xname]
             [(_ arg (... ...))
              #'((<span style="color: #a020f0;">fluid-let-syntax</span> ([name (identifier-syntax xname)])
                   (<span style="color: #a020f0;">lambda</span> formals form1 form2 ...))
                  arg
                  (... ...))]))))]))
</pre>
</div>

<p>
The <code>define-integrable</code> keyword can be used as follows:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define-integrable count
  (<span style="color: #a020f0;">lambda</span> (ls)
    (<span style="color: #a020f0;">if</span> (null? ls)
        0
        (+ (car ls) (count (cdr ls))))))

(list (count '(1 2 3))
      (procedure? count))
</pre>
</div>

<pre class="example" id="orgc0fcc31">
(6 #t)
</pre>

<p>
This definition binds <code>count</code> to a keyword that behaves like an
immutable variable bound to a procedure.  However, when <code>count</code> is
used in the form <code>(count '(1 2 3))</code> the procedures body is inlined at
the macro use site, allowing for more local optimizations.  We chose
the example of a recursive procedure because it demonstrates a
difficulty: If <code>count</code> in the procedure's body were also inlined and
so on, we would get an infinite macro expansion.  Instead, the
implementation of <code>define-integrable</code> uses a syntax parameter to
rebound <code>count</code> in the procedure body so that it is not further
inlined.
</p>
</div>
</div>
