README.org
** Identifier properties

It is often the case that two different macros have to communicate.
In its simplest form we already saw it, namely in the case of macros
whose behavior depends on the presence of auxiliary syntax (another
macro) in their inputs.  A typical example is Scheme's ~cond~ keyword
(implementable as a macro in terms of ~if~) that uses the ~else~
auxiliary syntax.

Such an auxiliary keyword can function as a yes/no flag.  Sometimes,
however, we may be interested in more than a boolean value.  This can
be done with identifier properties, which are implemented in Chez
Scheme and also described in [[https://srfi.schemers.org/srfi-213/srfi-213.html][SRFI 213]].

An identifier property are superficially similar to symbol properties
of Lisp, but there are important differences making them work with
Scheme's macro system.  Identifier properties are associated with an
existing binding of an identifier and thus automatically lexically
scoped.  Each property is keyed by the binding of another identifier,
so also property keys are lexically scoped.

The ~define-property~ form, which can be used where ever a definition
can be used, associates properties with identifiers:

#+BEGIN_SRC scheme :results none
  (define add1 (lambda (x) (+ 1 x)))
  (define key)
  (define-property add1 key #'"value")
#+END_SRC

If the ~define-property~ appears in a context evaluated at relative
phase /n/, the very right-hand side of ~define-property~ is evaluated
at relative phase /n/ + 1, much like the right-hand side of
~define-syntax~.  This means that the property value, ~"(syntax "value")"~ in
this example, is accessible at expand-time, but not a run-time.

Regardless of the identifier property attached to ~add1~, the
identifier is still a variable resolving to a procedure adding one to
its argument:

#+BEGIN_SRC scheme :results value :exports both :wrap example
  (add1 2)
#+END_SRC

#+RESULTS:
#+begin_example
3
#+end_example

Macro transformers can retrieve the values of identifier properties.
If the need to do so, they have to return a procedure instead of a
syntax object.  The returned procedure must accept one argument,
~lookup~ and should return the syntax object which is the result of
the transformation.  The ~lookup~ procedure takes two arguments ~id~
and ~key~, which must be bound identifiers, and returns the value of
the identifier property associated to ~id~ and keyed by ~key~, or ~#f~
if there is none:

#+BEGIN_SRC scheme :results scalar :exports both :wrap example
  (let-syntax
      ([x
        (lambda (stx)
          (lambda (lookup)
            (syntax-case stx ()
              [(_ key)
               (or (lookup #'add1 #'key)
                   #'"no-value")])))])
    (define other-key)
    (list (x key) (x other-key)))
#+END_SRC

#+RESULTS:
#+begin_example
("value" "no-value")
#+end_example

While this example theoretically describes how identifier properties
work, it doesn't show their usefulness.  A more practical example is
given by another loop macro, modeling general ~for~, we are going to
present:

#+BEGIN_SRC scheme :results silent
  (define key)

  (define-syntax define-iterator
    (lambda (stx)
      (syntax-case stx ()
        [(define-iterator name parser-expr)
         (identifier? #'name)
         #'(begin
             (define-syntax name
               (lambda (stx)
                 (syntax-violation 'name "invalid use of for keyword" stx)))
             (define-property name key
               (let ([parser parser-expr])
                 (unless (procedure? parser)
                   (assertion-violation 'define-iterator "invalid parser" parser))
                 parser)))])))

  (define-syntax for
    (lambda (stx)
      (lambda (lookup)
        (define parse-clause
          (lambda (cl)
            (syntax-case cl ()
              [(formals keyword . arg)
               (identifier? #'keyword)
               (let ([keyword #'keyword])
                 (define parser (lookup keyword #'key))
                 (unless (procedure? parser)
                   (syntax-violation 'for "invalid for iterator" stx keyword))
                 (let-values ([(outer-var* var* loop-var*
                                outer-expr init-expr test-expr loop-expr step-expr)
                               (parser stx cl)])
                   (list outer-var* var* loop-var*
                         outer-expr init-expr test-expr loop-expr step-expr)))])))
        (syntax-case stx ()
          [(_ (clause ...) command ...)
           (with-syntax ([(((outer-var ...) (var ...) (loop-var ...)
                            outer-expr init-expr test-expr loop-expr step-expr) ...)
                          (map parse-clause #'(clause ...))])
             #'(let-values ([(outer-var ...) outer-expr] ...)
                 (let-values ([(var ...) init-expr] ...)
                   (let f ([var var] ... ...)
                     (unless (or test-expr ...)
                       (let-values ([(loop-var ...) loop-expr] ...)
                         command ...
                         (let-values ([(var ...) step-expr] ...)
                           (f var ... ...))))))))]))))

  (define-iterator in-list
    (lambda (stx cl)
      (syntax-case cl ()
        [(var _ list-expr)
         (identifier? #'var)
         (values #'()
                 #'(tmp)
                 #'(var)
                 #'(values)
                 #'list-expr
                 #'(null? tmp)
                 #'(car tmp)
                 #'(cdr tmp))])))

  (define-iterator in-range
    (lambda (stx cl)
      (syntax-case cl ()
        [(var _ start-expr end-expr)
         (identifier? #'var)
         (values #'(end)
                 #'(i)
                 #'(var)
                 #'end-expr
                 #'start-expr
                 #'(>= i end)
                 #'i
                 #'(+ i 1))])))
#+END_SRC

The public API for our new loop facility consists of the ~for~ keyword
and the ~define-iterator~ defining keyword.  Moreover, we defined two
iterator forms, one for going through a list and the other one for going
through a numeric range.  The loop facility is extensible because the
user can define more iterator forms using ~define-iterator~.

A typical use of a ~for~ loop can look like the following:

#+BEGIN_SRC scheme :results output :exports both :wrap example
  (for ([x in-list '(a b c)]
        [i in-range 0 10])
    (display (list x i))
    (newline))
#+END_SRC

#+RESULTS:
#+begin_example
(a 0)
(b 1)
(c 2)
#+end_example

In a language without a powerful macro system as Scheme possesses it,
if it doesn't ship a suitable looping construct for our needs, we
can't do anything except hoping for a future version of the language
that includes more looping constructs.  In Scheme, on the other hand,
a small and simple core suffices as we can build syntactic
abstractions as much as we can build procedural abstractions
ourselves.  Many advertised "brand new" features of en-vogue or
not-so-en-vogue languages may sound like a big yawn to a Schemer.

In our implementation of the ~for~ macro above, we used identifier
properties on the iterator keywords to communicate with the main ~for~
macro.  This hints at how we can build powerful, extensible
sub-languages into Scheme.

