README.html

<div id="outline-container-orgbf1d363" class="outline-3">
<h3 id="orgbf1d363"><span class="section-number-3">9.3.</span> Identifier properties</h3>
<div class="outline-text-3" id="text-9-3">
<p>
It is often the case that two different macros have to communicate.
In its simplest form we already saw it, namely in the case of macros
whose behavior depends on the presence of auxiliary syntax (another
macro) in their inputs.  A typical example is Scheme's <code>cond</code> keyword
(implementable as a macro in terms of <code>if</code>) that uses the <code>else</code>
auxiliary syntax.
</p>

<p>
Such an auxiliary keyword can function as a yes/no flag.  Sometimes,
however, we may be interested in more than a boolean value.  This can
be done with identifier properties, which are implemented in Chez
Scheme and also described in <a href="https://srfi.schemers.org/srfi-213/srfi-213.html">SRFI 213</a>.
</p>

<p>
An identifier property are superficially similar to symbol properties
of Lisp, but there are important differences making them work with
Scheme's macro system.  Identifier properties are associated with an
existing binding of an identifier and thus automatically lexically
scoped.  Each property is keyed by the binding of another identifier,
so also property keys are lexically scoped.
</p>

<p>
The <code>define-property</code> form, which can be used where ever a definition
can be used, associates properties with identifiers:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">add1</span> (<span style="color: #a020f0;">lambda</span> (x) (+ 1 x)))
(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">key</span>)
(define-property add1 key #'<span style="color: #8b2252;">"value"</span>)
</pre>
</div>

<p>
If the <code>define-property</code> appears in a context evaluated at relative
phase <i>n</i>, the very right-hand side of <code>define-property</code> is evaluated
at relative phase <i>n</i> + 1, much like the right-hand side of
<code>define-syntax</code>.  This means that the property value, <code>"(syntax "value")"</code> in
this example, is accessible at expand-time, but not a run-time.
</p>

<p>
Regardless of the identifier property attached to <code>add1</code>, the
identifier is still a variable resolving to a procedure adding one to
its argument:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(add1 2)
</pre>
</div>

<pre class="example" id="orge6d47bd">
3
</pre>

<p>
Macro transformers can retrieve the values of identifier properties.
If the need to do so, they have to return a procedure instead of a
syntax object.  The returned procedure must accept one argument,
<code>lookup</code> and should return the syntax object which is the result of
the transformation.  The <code>lookup</code> procedure takes two arguments <code>id</code>
and <code>key</code>, which must be bound identifiers, and returns the value of
the identifier property associated to <code>id</code> and keyed by <code>key</code>, or <code>#f</code>
if there is none:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">let-syntax</span>
    ([x
      (<span style="color: #a020f0;">lambda</span> (stx)
        (<span style="color: #a020f0;">lambda</span> (lookup)
          (<span style="color: #a020f0;">syntax-case</span> stx ()
            [(_ key)
             (<span style="color: #a020f0;">or</span> (lookup #'add1 #'key)
                 #'<span style="color: #8b2252;">"no-value"</span>)])))])
  (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">other-key</span>)
  (list (x key) (x other-key)))
</pre>
</div>

<pre class="example" id="orgae090e6">
("value" "no-value")
</pre>

<p>
While this example theoretically describes how identifier properties
work, it doesn't show their usefulness.  A more practical example is
given by another loop macro, modeling general <code>for</code>, we are going to
present:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">key</span>)

(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">define-iterator</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">syntax-case</span> stx ()
      [(define-iterator name parser-expr)
       (identifier? #'name)
       #'(<span style="color: #a020f0;">begin</span>
           (<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">name</span>
             (<span style="color: #a020f0;">lambda</span> (stx)
               (syntax-violation 'name <span style="color: #8b2252;">"invalid use of for keyword"</span> stx)))
           (define-property name key
             (<span style="color: #a020f0;">let</span> ([parser parser-expr])
               (<span style="color: #a020f0;">unless</span> (procedure? parser)
                 (assertion-violation 'define-iterator <span style="color: #8b2252;">"invalid parser"</span> parser))
               parser)))])))

(<span style="color: #a020f0;">define-syntax</span> <span style="color: #a0522d;">for</span>
  (<span style="color: #a020f0;">lambda</span> (stx)
    (<span style="color: #a020f0;">lambda</span> (lookup)
      (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">parse-clause</span>
        (<span style="color: #a020f0;">lambda</span> (cl)
          (<span style="color: #a020f0;">syntax-case</span> cl ()
            [(formals keyword . arg)
             (identifier? #'keyword)
             (<span style="color: #a020f0;">let</span> ([keyword #'keyword])
               (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">parser</span> (lookup keyword #'key))
               (<span style="color: #a020f0;">unless</span> (procedure? parser)
                 (syntax-violation 'for <span style="color: #8b2252;">"invalid for iterator"</span> stx keyword))
               (<span style="color: #a020f0;">let-values</span> ([(outer-var* var* loop-var*
                              outer-expr init-expr test-expr loop-expr step-expr)
                             (parser stx cl)])
                 (list outer-var* var* loop-var*
                       outer-expr init-expr test-expr loop-expr step-expr)))])))
      (<span style="color: #a020f0;">syntax-case</span> stx ()
        [(_ (clause ...) command ...)
         (with-syntax ([(((outer-var ...) (var ...) (loop-var ...)
                          outer-expr init-expr test-expr loop-expr step-expr) ...)
                        (<span style="color: #a020f0;">map</span> parse-clause #'(clause ...))])
           #'(<span style="color: #a020f0;">let-values</span> ([(outer-var ...) outer-expr] ...)
               (<span style="color: #a020f0;">let-values</span> ([(var ...) init-expr] ...)
                 (<span style="color: #a020f0;">let</span> <span style="color: #0000ff;">f</span> ([var var] ... ...)
                   (<span style="color: #a020f0;">unless</span> (<span style="color: #a020f0;">or</span> test-expr ...)
                     (<span style="color: #a020f0;">let-values</span> ([(loop-var ...) loop-expr] ...)
                       command ...
                       (<span style="color: #a020f0;">let-values</span> ([(var ...) step-expr] ...)
                         (f var ... ...))))))))]))))

(define-iterator in-list
  (<span style="color: #a020f0;">lambda</span> (stx cl)
    (<span style="color: #a020f0;">syntax-case</span> cl ()
      [(var _ list-expr)
       (identifier? #'var)
       (values #'()
               #'(tmp)
               #'(var)
               #'(values)
               #'list-expr
               #'(null? tmp)
               #'(car tmp)
               #'(cdr tmp))])))

(define-iterator in-range
  (<span style="color: #a020f0;">lambda</span> (stx cl)
    (<span style="color: #a020f0;">syntax-case</span> cl ()
      [(var _ start-expr end-expr)
       (identifier? #'var)
       (values #'(end)
               #'(i)
               #'(var)
               #'end-expr
               #'start-expr
               #'(&gt;= i end)
               #'i
               #'(+ i 1))])))
</pre>
</div>

<p>
The public API for our new loop facility consists of the <code>for</code> keyword
and the <code>define-iterator</code> defining keyword.  Moreover, we defined two
iterator forms, one for going through a list and the other one for going
through a numeric range.  The loop facility is extensible because the
user can define more iterator forms using <code>define-iterator</code>.
</p>

<p>
A typical use of a <code>for</code> loop can look like the following:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(for ([x in-list '(a b c)]
      [i in-range 0 10])
  (display (list x i))
  (newline))
</pre>
</div>

<pre class="example" id="org945c8ed">
(a 0)
(b 1)
(c 2)
</pre>

<p>
In a language without a powerful macro system as Scheme possesses it,
if it doesn't ship a suitable looping construct for our needs, we
can't do anything except hoping for a future version of the language
that includes more looping constructs.  In Scheme, on the other hand,
a small and simple core suffices as we can build syntactic
abstractions as much as we can build procedural abstractions
ourselves.  Many advertised "brand new" features of en-vogue or
not-so-en-vogue languages may sound like a big yawn to a Schemer.
</p>

<p>
In our implementation of the <code>for</code> macro above, we used identifier
properties on the iterator keywords to communicate with the main <code>for</code>
macro.  This hints at how we can build powerful, extensible
sub-languages into Scheme.
</p>
</div>
</div>
</div>
