README.html

<div id="outline-container-org28a9422" class="outline-2">
<h2 id="org28a9422"><span class="section-number-2">10.</span> Complex examples</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgfe7512d" class="outline-3">
<h3 id="orgfe7512d"><span class="section-number-3">10.1.</span> An LR(1) parser generator implemented as a Scheme macro</h3>
<div class="outline-text-3" id="text-10-1">
<p>
The power of Scheme's procedural macros enables us to stay within
Scheme and within one Scheme process all the time.  Let us consider a
parser generator like GNU Bison as a case study.  A classical parser
generator is a separate executable that takes a grammar (for some
formal language) interspersed with semantic actions and outputs source
code implementing a parser for that language.
</p>

<p>
The process is rather fragile as it depends a lot on text
substitutions and the parser generator is ignorant about the embedded
semantic code in the target language.  Moreover, an external tool is
needed.
</p>

<p>
In Scheme, on the other hand, we can write a macro that takes a
grammar (described using Scheme's ordinary lexical syntax) and
semantic expressions and replaces it at compile-time with the
definition of a parser of this languages, obeying, among other
things. the lexical scoping of the embedded semantic expressions.
</p>

<p>
We have written such a macro that implements an LR(1)-parser generator
in roughly 1000 lines to demonstrate a highly non-trivial macro (or
sub-language).  The source code can be found in the <a href="https://github.com/mnieper/scheme-macros/blob/main/lib">library directory</a>
of this tutorial's GitHub repository.
</p>

<p>
It is written as an R6RS library, which we can readily import:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">import</span> (languages))
</pre>
</div>

<p>
The following gives an example of how a grammar together with semantic
actions is defined:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define-language (make-parser token token?)
  (nonterminals exp term factor)
  (terminals NUM <span style="color: #8b2252;">"+"</span> <span style="color: #8b2252;">"-"</span> <span style="color: #8b2252;">"*"</span> <span style="color: #8b2252;">"/"</span> <span style="color: #8b2252;">"("</span> <span style="color: #8b2252;">")"</span>)
  (rules
   [(exp -&gt; exp <span style="color: #8b2252;">"+"</span> term)
    (+ exp term)]
   [(exp -&gt; exp <span style="color: #8b2252;">"-"</span> term)
    (- exp term)]
   [(exp -&gt; term)]
   [(term -&gt; term <span style="color: #8b2252;">"*"</span> factor)
    (* term factor)]
   [(term -&gt; term <span style="color: #8b2252;">"/"</span> factor)
    (/ term factor)]
   [(term -&gt; factor)]
   [(factor -&gt; NUM)]
   [(factor -&gt; <span style="color: #8b2252;">"("</span> exp <span style="color: #8b2252;">")"</span>)
    exp])
  (start exp))
</pre>
</div>

<p>
This definition binds <code>make-parser</code> to a thunk (a procedure taking no
arguments) that when called returns a <i>parser</i> for the defined
language.  A parser is a procedure.  Calling it with one value, a
<i>token</i>, pushes this token in the parser.  Calling it with zero
values, signals an end of the input and the procedure returns the
semantic value of the sentences consisting of the token pushed so far.
</p>

<p>
A convenience procedure <code>parse</code> is defined that pushes a fixed number
of tokens and is used in the following example:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(parse (make-parser)
       (token NUM 3)
       (token <span style="color: #8b2252;">"+"</span>)
       (token NUM 2)
       (token <span style="color: #8b2252;">"*"</span>)
       (token NUM 7)
       (token <span style="color: #8b2252;">"-"</span>)
       (token NUM 1))
</pre>
</div>

<pre class="example" id="org0a06aa1">
16
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd9c6470" class="outline-2">
<h2 id="orgd9c6470"><span class="section-number-2">11.</span> Exercises</h2>
<div class="outline-text-2" id="text-11">
<ol class="org-ol">
<li>Write a macro <code>push!</code> such that <code>(push! list-variable expression)</code>
prepends the value of <code>expression</code> to the list bound to the
<code>list-variable</code>.</li>

<li>Write a macro <code>when-all</code> such that <code>(when-all test-expression
   ... expression)</code> evaluates <code>expression</code> only if all
<code>test-expressions</code> evaluate to <code>#f</code>.  The macro should
short-circuit the evaluation the <code>test-expressions</code> as soon as one
evaluates to <code>#f</code>.</li>

<li>Write a macro <code>alist</code> such that <code>(alist key1 value key2 value2
   ... )</code> expands into a literal expression of the form <code>'((key1
   value1) (key2 value2) ...)</code>.</li>

<li>Write a macro <code>timestamp</code> such that <code>timestamp</code> expands into a
number literal counting the number of uses of <code>timestamp</code>.</li>

<li>Rewrite <code>fluid-let</code> as a recursive macro that does not use
<code>generate-temporaries</code>.</li>

<li>Write a procedure <code>symbolic-identifier=?</code> so that
<code>(symbolic-identifier=? id1 id2)</code> returns <code>#t</code> if and only if the
two identifiers <code>id1</code> and <code>id2</code> have the same symbolic name.</li>

<li>Extend the <code>loop</code> macro so that evaluating <code>(continue)</code> skips the
rest of the current loop iteration and the loop continues with the
next iteration.</li>

<li>Modify the <code>for</code> macro into a functional form supporting
user-definable accumulators whose final result are returned by the
<code>for</code> expression.</li>

<li>Write a pattern matching Scheme macro.</li>

<li>Make the parser generator more user friendly.  It should provide
more information at compile-time when shift/reduce and
reduce/reduce conflicts are reported and at run-time when syntax
errors are reported.  Implement operator precedence and
associativity rules to handle some shift/reduce and reduce/reduce
conflicts automatically.</li>

<li>Write a version of the lex scanner generator as a Scheme macro.</li>
</ol>
</div>
</div>
