README.org
* Footnotes

[fn:1]This may change when the R7RS-large standardization effort is
finished.  Both, R6RS and R7RS-small, are successors (and extensions)
to R5RS (1998), but R7RS-small was never meant to be seen in isolation
as a successor to R6RS.  Time will tell whether the R7RS large
language will be able to replace R6RS when it is finally done.  It is
planned to include the R6RS macro facility and the extensions
discussed here in R7RS-large.

#  LocalWords:  preprocessor expander homoiconic matchers Chez SRFI

[fn:2]While Scheme does not forbid mutation (like ML but unlike
Haskell), the pitfalls of impure code are well-understood.  Therefore,
the names of Scheme procedures and syntax that modifies locations in
the store (the Scheme model of the computer's memory) end with a ~!~
by convention.

[fn:3]More precicely: as a variable holding a procedure value.

[fn:4]When interactively testing our procedures and syntax (keywords),
one has to be careful that we have given both the procedure and the
keyword the same name.  Evaluating one of the definitions will
overwrite the meaning of the other one.

[fn:5]Such a form is predefined in Chez Scheme, but is not part of the
Scheme standard.  In fact, Chez Scheme's version properly handles tail
calls, which our simple version doesn't.

[fn:6]Note that this cannot be done with C preprocessor macros.

[fn:7]The term "history" of an identifier is not an established one
but was invented for this presentation.

[fn:8]When used in programs or libraries, there is one problem in the
first approach because of so-called phasing issues.  We will come back
to this.

[fn:9]In fact, the standard binding constructs in Scheme ~let~,
~let*~, or ~letrec~ can also be defined as macro keywords in terms of
the more primitive ~lambda~ using the macro facility described in this
report.

[fn:10]Remember that Scheme has first-class continuation.  But this is
a topic for a different tutorial.

[fn:11]In-depth advanced information can be found in the paper [[http://scheme2011.ucombinator.org/papers/Barzilay2011.pdf][Keeping
it Clean with Syntax Parameters]].

# Local Variables:
# ispell-local-dictionary: "english"
# End:
#  LocalWords:  boolean inlined lex
